// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1
ListModel{
    //id:febmodel
    ListElement{
        fest:"愚人节"
        picture:"yurenjie.jpg"
        detail:"愚人节也称万愚节，是西方社会民间传统节日，节期在每年4月1日。"
        story:"<html>
<p>&nbsp;&nbsp;愚人节与古罗马的嬉乐节和印度的欢悦节有相似之处。从时间的选择上看与“春分”有关，因为这期间天气常常突然变化，恰是似大自然在愚弄人类。这一天，人们以多种方式开周围的人的玩笑，但最晚只能开到中午12点，这是约定俗成的严格规矩。
<p>&nbsp;&nbsp;相传1582年，法国国王查理九世决定采用新改革的纪年法——格里高利历（即目前通用的阳历），以1月1日为一年的开始，改变了过去以4月1日为新年开端，送新年礼的惯例。主张改革的人把守旧派这些做法大加嘲弄，在这天给他们送假礼物，邀请他们参加假的聚会。从此，4月1日捉弄人的习俗便流传开来。
<p>&nbsp;&nbsp;其实过节的习俗有很多，如在愚人节的聚会上，还有一种做假菜的风俗。有人曾经描述过一个典型的愚人节菜谱：先是一道“色拉”，莴苣叶上撒满了绿胡椒，但是把叶子揭开后，才发现下面原来是牡蛎鸡尾酒；第二道菜是“烤土豆”，其实下面是甜面包屑和鲜蘑；此后上的菜还有用蟹肉作伪装的烧鸡和埋藏在西红柿色拉下面的覆盆子冰淇淋。饭后，客人还可以从药丸盒里取食糖果。有的人把细线拴着的钱包丢在大街上，自己在暗处拉着线的另一端。一旦有人捡起钱包，他们就出其不意地猛然把钱包拽走。还有人把砖头放在破帽子下面搁在马路当中，然后等着看谁来了会踢它。小孩们会告诉父母说自己的书包破了个洞或者脸上有个黑点．等大人俯身来看时，他们就一边喊着“四月傻瓜”，一边笑着跑开去。
<p>&nbsp;&nbsp;总之，每逢愚人节这一天，动物园和水族馆还会接到不少打给菲什（fish）先生泰歌（tiger）先生的电话，常常惹得工作人员掐断电话线，以便减少麻烦。</p>
<html/>"

    }
    ListElement{
        fest:"清明节"
        picture:"qingmingjie.jpg"
        detail:"  清明节是农历二十四节气之一，在仲春与暮春之交，也就是冬至后的108天。"
        story:"  <html>
   <p>&nbsp;&nbsp;清明节是农历二十四节气之一，在仲春与暮春之交，也就是冬至后的108天。中国汉族传统的清明节大约始于周代，距今已有二千五百多年的历史。《历书》：“春分后十五日，斗指丁，为清明，时万物皆洁齐而清明，盖时当气清景明，万物皆显，因此得名。”清明一到，气温升高，正是春耕春种的大好时节，故有“清明前后，种瓜点豆”之说。
   <p>&nbsp;&nbsp;清明节是一个祭祀祖先的节日，传统活动为扫墓。2006年5月20日，经国务院批准列入第一批国家级非物质文化遗产名录。
 </html>"

    }
    ListElement{
        fest:"谷雨"
        picture:"guyu.jpg"
        detail:"谷雨是二十四节气的第六个节气，每年4月19日～21日视太阳到达黄经30°时为谷雨"
        story:"<html>
<p>&nbsp;&nbsp;谷雨，源自古人“雨生百谷”之说。同时也是播种移苗、埯瓜点豆的最佳时节。“清明断雪，谷雨断霜”，气象专家表示，谷雨是春季最后一个节气，谷雨节气的到来意味着寒潮天气基本结束，气温回升加快，大大有利于谷类农作物的生长。谷雨的天气特点中国古代将谷雨分为三候：“第一候萍始生；第二候鸣鸠拂其羽；第三候为戴胜降于桑。”是说谷雨后降雨量增多，浮萍开始生长，接着布谷鸟便开始提醒人们播种了，然后是桑树上开始见到戴胜鸟。
<p>&nbsp;&nbsp;谷雨节气后降雨增多，空气中的湿度逐渐加大，此时我们在养生中应遵遁自然节气的变化，针对其气候特点进行调养。同时由于天气转温，人们的室外活动增加，北方地区的桃花、杏花等开放；杨絮、柳絮四处飞扬。雨生百谷。雨量充足而及时，谷类作物能茁壮成长。谷雨时节的南方地区，“杨花落尽子规啼”，柳絮飞落，杜鹃夜啼，牡丹吐蕊，樱桃红熟，自然景物告示人们：时至暮春了。这时，南方的气温升高较快，一般4月下旬平均气温，除了华南北部和西部部分地区外，已达20℃至22℃，比中旬增高2℃以上。华南东部常会有一、二天出现30以上的高温，使人开始有炎热之感。
<p>&nbsp;&nbsp;“谷雨前，好种棉”，又云：“谷雨不种花，心头像蟹爬”。自古以来，棉农把谷雨节作为棉花播种指标，编成谚语，世代相传。谷雨节的天气谚语大部分围绕有雨无雨这个中心，如“谷雨阴沉沉，立夏雨淋淋”、“谷雨下雨，四十五日无干土”等等。还有谷雨节气如气温偏高，阴雨频繁，会使三麦病虫害发生和流行。广大农村要根据天气变化，搞好三麦病虫害防治。
<html/>"
    }


}
