// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"建军节"
        picture:"jianjunjie.jpg"
        detail:"每年的八月一日是中国人民解放军建军纪念日，因此也叫“八一”建军节。"
        story:"<html>
<p>&nbsp;&nbsp;南昌起义，是中国共产党直接领导的带有全局意义的一次武装暴动。它打响了武装反抗国民党反动派的第一枪，宣告了中国共产党把中国革命进行到底的坚定立场，标志着中国共产党独立地创造革命军队和领导革命战争的开始。1933年7月11日，中华苏维埃共和国临时中央政府根据中央革命军事委员会6月30日的建议，决定8月1日为中国工农红军成立纪念日。从此，8月1日成为中国工农红军和后来的中国人民解放军的建军节。
<p>&nbsp;&nbsp;南昌起义，由于客观上敌人力量过于强大，主观指导上缺乏经验，没有和湘、鄂、赣地区的农民运动相结合，开展土地革命战争，而是孤军南下广东，企图打开海口，争取外援，重建革命根据地，再次举行北代，加之两次分兵，不能集中兵力歼敌，成为敌人各个击破等原因，最后遭至失败。但这次起义的伟大历史功绩是不可磨灭的。它在全党和全国人民面前树立了一面鲜明的武装斗争旗帜，充分地表现了中国共产党和中国人民不畏强敌、前仆后继的革命精神。它以实际行动批评了陈独秀的右倾投降主义，沉重地打击了国民党反动派的嚣张气焰，极大地鼓舞了全国人民的革命斗志。它对创建伟大的人民军队作出了重大的贡献。<html/>"

    }
    ListElement{
        fest:"立秋"
        picture:"liqiu.jpg"
        detail:"立秋，是二十四节气中的第13个节气，每年8月7、8或9日立秋。"
        story:"<html>
<p>&nbsp;&nbsp;每年8月7日或8日视太阳到达黄经135°时为立秋。
<p>&nbsp;&nbsp;《月令七十二候集解》：“七月节，立字解见春（立春）。秋，揪也，物于此而揪敛也。”立秋一般预示着炎热的夏天即将过去，秋天即将来临。立秋后虽然一时暑气难消，还有“秋老虎”的余威，立秋又称交秋，但总的趋势是天气逐渐凉爽。由于全国各地气候不同，秋季开始时间也不一致。气候学上以每5天的日平均气温稳定下降到22℃以下的始日作为秋季开始，这种划分方法比较符合各地实际，但与黄河中下游立秋日期相差较大。立秋以后，我国中部地区早稻收割，晚稻移栽，大秋作物进入重要生长发育时期。秋的意思是暑去凉来，秋天开始。古人把立秋当作夏秋之交的重要时刻，一直很重视这个节气。<html/>"

    }
    ListElement{
        fest:"处暑"
        picture:"chushu.jpg"
        detail:"处暑，二十四节气之一。处暑节气在每年八月二十三日左右。"
        story:"<html>
<p>&nbsp;&nbsp;处暑养生据《月令七十二候集解》说：“处，去也，暑气至此而止矣。”意思是炎热的夏天即将过去了。虽然，处暑前后我国北京、太原、西安、成都和贵阳一线以东及以南的广大地区和新疆塔里木盆地地区日平均气温仍在摄氏二十二度以上，处于夏季，但是这时冷空气南下次数增多，气温下降逐渐明显。
<p>&nbsp;&nbsp;我国古代将处暑分为三候：“一候鹰乃祭鸟；二候天地始肃；三候禾乃登。”此节气中老鹰开始大量捕猎鸟类；天地间万物开始凋零；“禾乃登”的“禾”指的是黍、稷、稻、粱类农作物的总称，“登”即成熟的意思。
<p>&nbsp;&nbsp;处暑是反映气温变化的一个节气。“处”含有躲藏、终止意思，“处暑”表示炎热暑天结束了。也就是说是炎热的夏天即将过去，到此为止了。处暑以后，除华南和西南地区外；我国大部分地区雨季即将结束，降水逐渐减少。尤其是华北、东北和西北地区必须抓紧蓄水、保墒；以防秋种期间出现干旱而延误冬作物的播种期。
<html/>"

    }
    ListElement{
        fest:"七夕"
        picture:"qixi.jpg"
        detail:"每年农历七月初七这一天是七夕节。"
        story:"<html>
<p>&nbsp;&nbsp;2006年5月20日，七夕节被国务院列入第一批国家非物质文化遗产名录。
<p>&nbsp;&nbsp;在晴朗的夏秋之夜，天上繁星闪耀，一道白茫茫的银河象天桥横贯南北，在河的东西两岸，各有一颗闪亮的星星，隔河相望，遥遥相对，那就是牵牛星和织女星。
<p>&nbsp;&nbsp;七夕坐看牵牛织女星，是民间的习俗。相传，在每年农历七月初七的夜晚，是天上织女与牛郎在鹊桥相会之时。
<p>牵牛星和织女星
<p>&nbsp;&nbsp;织女是一个美丽聪明、心灵手巧的仙女，凡间的妇女便在这一天晚上向她乞求智慧和巧艺，也少不了向她求赐美满姻缘，所以七月初七也被称为乞巧节。
<p>&nbsp;&nbsp;人们传说在七夕的夜晚，抬头可以看到牛郎织女的银河相会，或在瓜果架下可偷听到两人在天上相会时的脉脉情话。
<p>&nbsp;&nbsp;女孩们在这个充满浪漫气息的晚上，对着天空的朗朗明月，摆上时令瓜果，朝天祭拜，乞求天上的仙 女能赋予她们聪慧的心灵和灵巧的双手，让自己的针织女工技法娴熟，更乞求爱情婚姻的姻缘巧配。过去婚姻对于女性来说是决定一生幸福与否的终身大事，所以， 世间无数的有情男女都会在这个晚上，夜静人深时刻，对着星空祈祷自己的姻缘美满。
<p>七夕应叫“中国女儿节”
<p>&nbsp;&nbsp;齐守成介绍，“七夕”节又叫乞巧节，最早起源于汉代。节俗是晒经书及衣裳，向双星乞愿和穿针乞巧。如果真要将七夕节赋予一种通俗的叫法儿，应该是“中国女儿节”。齐守成解释，在历史上“七夕”节这一天，未出门的姑娘们一定要手绑彩线，乞求未来像天上的织女一样心灵手巧，因此，“七夕节”是古代女孩最重视的节日。七夕节的传统活动就是女孩子们用彩线穿上绣针，比比谁的针线活做得好，同时摆上瓜果贡品，乞求心灵手巧。
<p>七夕节被误为“情人节”
<p>&nbsp;&nbsp;之所以当今社会将七夕节误读为“情人节”，可能是源于牛郎织女的浪漫凄美的爱情故事。事实上，“中国情人节”确实有，但不是七夕，而是正月十五“元宵节”，即“上元节”。按照中国 民间的传统，在一年中第一个月圆之夜，人们要点起彩灯、出门赏月、燃放焰火。“在古代，受到封建思想的影响，妇女往往都是大门不出二门不迈，抛头露面是不 守礼节的做法，只有在正月十五这一天，才能出门逛灯会，少男少女这一天才能互相会面，倾诉爱慕之情。所以，正月十五，才算是真正的中国情人节。 ”
<p>&nbsp;&nbsp;很多商家将七夕节当成情人节进行商业炒作，很多青年人把七夕节当成情人节来过，这种做法不仅不 利于传统节日的保护，而且将传统节日的文化内涵扭曲了。“包括媒体都应该多宣传传统节日的文化内涵，对如何过传统节日有个正确的引导。七夕节之所以能列为 国家非物质文化遗产名录，就是因为它是有中国特色的节日。我们应该珍惜，千万不能把自己的东西丢了。
<html/>"

    }
    ListElement{
        fest:"西红柿节"
        picture:"xihongshijie.jpg"
        detail:"  每年8月最后一个星期三，在西班牙都会举行一年一度的西红柿节。"
        story:"<html>
<p>&nbsp;&nbsp;彼时当局一度禁止人们互相投掷西红柿，但当地人举行大规模游行示威。终于在1957年，当局同意将每年八月最后一个周三确定为“西红柿节”，并由当局提供西红柿。2002年，西班牙政府将“西红柿节”列入具有国际旅游价值的节日。
</html>"

    }
    ListElement{
        fest:"中元节"
        picture:"zhongyuanjie.jpg"
        detail:"每年农历七月十五日为“盂兰盆节”，也称“中元节”有些地方又州俗称“鬼节”，“施孤”。"
        story:"<html>
<p>&nbsp;&nbsp;中元节本是印度一种佛教仪式，佛教徒为了追荐祖先举行“盂兰盆会”。佛经中《盂兰盆经》以修孝顺励佛的旨意，合乎中国追先悼远的俗信，于是益加普及。
       民间普遍流传目莲解救母厄的故事：“有目莲僧者，法力宏大。其母堕落饿鬼道中，食物入口，即化为烈焰，饥苦太甚。目莲无法解救母厄，于是求教于佛，为说盂兰盆经，教于七月十五日作盂兰盆以救其母。
<html/>"

    }
}
