// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"大雪"
        picture:"daxue.jpg"
        detail:"“大雪”节气，通常在每年的12月7日，其时视太阳到达黄经255度。"
        story:"<html>
<p>&nbsp;&nbsp;《月令七十二候集解》说：至此而雪盛也。大雪的意思是降雪的可能性比小雪时更大，并不是指降雪量更多。相反，大雪后各地降水量均进一步减少，东北、华北地区12月平均降水量一般只有几毫米，西北地区则不到1毫米。
       人常说，“瑞雪兆丰年”。严冬积雪覆盖大地，可保持地面及作物周围的温度不会因寒流侵袭而降得很低，为冬作物创造了良好的越冬环境。积雪融化时又增加了土壤水分含量，可供作物春季生长的需要。另外，雪水中氮化物的含量是普通雨水的5倍，还有一定的肥田作用。所以有“今年麦盖三层被，来年枕着馒头睡”的农谚。
<p>&nbsp;&nbsp;大雪时节，除华南和云南南部无冬区外，我国辽阔的大地均已披上冬日盛装。东北、西北地区平均气温已降至-10℃，黄河流域和华北地区气温也稳定在0℃以下。在气候正常年份，黄河流域以及以北地区已有积雪出现，冬小麦已停止生长。大雪以后，江南进入隆冬时节，各地气温显著下降，常出现冰冻现象，“大雪冬至后，篮装水不漏”就是这个时间的真实写照，但是有的年也不尽然，气温较高，无冻结现象，往往造成后期雨水多。江淮及以南地区小麦、油菜仍在缓慢生长，要注意施好腊肥，为安全越冬和来春生长打好基础。华南、西南小麦进入分蘖期，应结合中耕施好分蘖肥，注意冬作物的清沟排水。这时天气虽冷，但贮藏的蔬菜和薯类要勤于检查，适时通风，不可将窖封闭太死，以免升温过高，湿度过大导致烂窖。在不受冻害的前提下应尽可能地保持较低的温度。
       大雪节气人们要注意气象台对强冷空气和低温的预报，注意防寒保暖。越冬作物要采取有效措施，防止冻害。注意牲畜防冻保暖。
<html/>"

    }
    ListElement{
        fest:"冬至"
        picture:"dongzhi.jpg"
        detail:"冬至是12月21日至12月23日交节，是北半球全年中白天最短、夜晚最长的一天。"
        story:"<html>
<p><p>&nbsp;&nbsp;冬至（Winter Solstice），是中国农历中一个非常重要的节气，也是中华民族的一个传统节日，冬至俗称“冬节”、“长至节”、“亚岁”等，早在二千五百多年前的春秋时代，中国就已经用土圭观测太阳，测定出了冬至，它是二十四节气中最早制订出的一个节气，时间在每年的阳历12月21日至23日之间，这一天是北半球全年中白天最短、夜晚最长的一天；中国北方大部分地区在这一天还有吃饺子、南方吃汤圆的习俗，谚语：冬至到，吃水饺，还有关于该节气的诗词和影视作品。
       冬至过节源于汉代，盛于唐宋，相沿至今。《清嘉录》甚至有“冬至大如年”之说。这表明古人对冬至十分重视。人们认为冬至是阴阳二气的自然转化，是上天赐予的福气。汉朝以冬至为“冬节”，官府要举行祝贺仪式称为“贺冬”，例行放假。《后汉书》中有这样的记载：“冬至前后，君子安身静体，百官绝事，不听政，择吉辰而后省事。”所以这天朝庭上下要放假休息，军队待命，边塞闭关，商旅停业，亲朋各以美食相赠，相互拜访，欢乐地过一个“安身静体”的节日。
       唐、宋时期，冬至是祭天祭祀祖的日子，皇帝在这天要到郊外举行祭天大典，百姓在这一天要向父母尊长祭拜，现在仍有一些地方在冬至这天过节庆贺。
<html/>"

    }
    ListElement{
        fest:"平安夜"
        picture:"pinganye.jpg"
        detail:"平安夜（Silent Night），即圣诞前夕（Christmas Eve，12月24日）"
        story:"<html>
<p>&nbsp;&nbsp;平安夜传统上是摆设圣诞树的日子，但随着圣诞节的庆祝活动提早开始进行，例如美国在感恩节后，不少圣诞树早在圣诞节前数星期已被摆设。延伸发展至今平安夜不仅是指12月24日晚了，指的是圣诞前夕，特指12月24日全天，但由于一般节日氛围在晚上容易调动起来，大型活动都集中在晚上，固被称作平安夜，更加贴切。届时，千千万万的欧美人风尘仆仆地赶回家中团聚。圣诞之夜必不可少的庆祝活动就是聚会。大多数欧美家庭成员团聚在家中，共进丰盛的晚餐，然后围坐在熊熊燃烧的火炉旁，弹琴唱歌，共叙天伦之乐；或者举办一个别开生面的化妆舞会，通宵达旦地庆祝圣诞夜是一个幸福、祥和、狂欢的平安夜、团圆夜。期待着圣诞节的到来，据说圣诞之夜，圣诞老人会悄悄地给孩子们准备礼物放在长筒袜里。<html/>"

    }
    ListElement{
        fest:"圣诞节"
        picture:"shengdanjie.jpg"
        detail:"圣诞节是基督教的一个重要的节日，定于每年12月25日。"
        story:"<html>
<p>&nbsp;&nbsp;圣诞节是为了纪念耶稣基督的诞生，同时也是普遍庆祝的世俗节日。纪念耶稣诞生的节期与时值仲冬的农节和太阳节这两个非基督教节日巧合，因此庆祝习俗来源不一。在罗马帝国范围之内，12月17日农神节是寻欢取乐、互相馈赠的日子。12月25日是古伊朗人所崇奉的正义之神密特拉的生日。古罗马人在元旦用青枝绿叶和灯火装饰房屋，并向儿童和穷人赠送礼物。条顿人各部族渗入高卢、不列颠和中欧等地，又带来日耳曼人和克尔特人的宗教仪式。于是，有了团聚欢宴、燃烧大块柴木、品尝大木形糕饼，张挂树枝、陈放枞树、访亲问友、来往馈赠等庆祝活动。象征温暖和长寿的火与灯光，一向是冬季节日庆祝活动中的内容，在基督教和非基督教习俗都是如此。常青树象征奋斗生存，自从中世纪以来就与耶稣圣诞节庆祝活动发生联系。由于历法不同，东正教及其他东欧教会的圣诞节日期相当于公历1月6日或7日。
<p>&nbsp;&nbsp;西方人以红、绿、白三色为圣诞色，圣诞节来临时家家户户都要用圣诞色来装饰。红色的有圣诞花和圣诞蜡烛。绿色的是圣诞树。它是圣诞节的主要装饰品，用砍伐来的杉、柏一类呈塔形的常青树装饰而成。上面悬挂着五颜六色的彩灯、礼物和纸花，还点燃着圣诞蜡烛。
       红色与白色相映成趣的是圣诞老人，他是圣诞节活动中最受欢迎的人物。西方儿童在圣诞夜临睡之前，要在壁炉前或枕头旁放上一只袜子，等候圣诞老人在他们入睡后把礼物放在袜子内。在西方，扮演圣诞老人也是一种习俗<html/>"

    }
}
