// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    //id:febmodel
    ListElement{
        fest:"圣蜡节"
        picture:"shenglajie.jpg"
        detail:"圣蜡节，这是一个宗教及美食的双重节日。"
        story:"<html>
<p>&nbsp;&nbsp;圣蜡节，这是一个宗教及美食的双重节日。这一天，家家都做鸡蛋薄饼，鸡蛋饼煎得又薄又黄，向太阳似的金黄色。它飘起来后，孩子们注视着它，如果它直接落在谁的口里该多好呀！
<html/>"

    }

    ListElement{
        fest:"小年"
        picture:"xiaonian.jpg"
        detail:"腊月二十三，又称“小年”，是民间祭灶的日子。"
        story:"<html>
<p>&nbsp;&nbsp;据说，每年腊月二十三，灶王爷都要上天向玉皇大帝禀报这家人的善恶，让玉皇大帝赏罚。因此送灶时，人们在灶王像前的桌案上供放糖果、清水、料豆、秣草；其中,后三样是为灶王升天的坐骑备料。祭灶时，还要把关东糖用火融化，涂在在灶王爷的嘴上。这样，他就不能在玉帝那里讲坏话了。民间有“男不拜月，女不祭灶”的习俗，因此祭灶王爷，只限于男子。另外，大年三十的晚上，灶王还要与诸神来人间过年，那天还得有“接灶”、“接神”的仪式。等到家家户户烧轿马，洒酒三杯，送走灶神以后，便轮到祭拜祖宗。
<html/>"

    }
    ListElement{
        fest:"除夕"
        picture:"chuxi.jpg"
        detail:" 年三十，也就是“除夕”。北方人包饺子，南方人做年糕。"
        story:"<html>
<p>&nbsp;&nbsp;除夕之夜，全家人在一起吃“团年饭”，有一家人团聚过年的味道。吃团年饭时，桌上的“鱼”是不能动的，因为这鱼代表“富裕”和“年年有余”，象征来年的“财富与幸运”，它属于一种装饰，是碰不得的。关于年的由来，还有一个传说。相传在远古时候，我们的祖先曾遭受一种最凶猛的野兽的威胁。这种猛兽叫“年”，它捕百兽为食，到了冬天，山中食物缺乏时，还会闯入村庄，猎食人和牲畜，百姓惶惶不可终日。人和“年”斗争了很多年，人们发现，年怕三种东西，红颜色、火光、响声。于是在冬天人们在自家门上挂上红颜色的桃木板，门口烧火堆，夜里通宵不睡，敲敲打打。这天夜里，“年”闯进村庄，见到家家有红色和火光，听见震天的响声，吓得跑回深山，再也不敢出来。夜过去了，人们互相祝贺道喜，大家张灯结彩，饮酒摆宴，庆祝胜利。
<p>&nbsp;&nbsp;为了纪念这次胜利，以后每到冬天的这个时间，家家户户都贴红纸对联在门上，电灯笼，敲锣打鼓，燃放鞭炮烟花；夜里，通宵守夜；第二天，大清早互相祝贺道喜。这样一代一代流传下来，就成了“过年”。除夕的高潮是年饭后长辈发“压岁钱”。接着就是张贴春联和门神，并关上大门。到初一的早上才开门“接财神”。接下来就是全家人守岁到凌晨。除夕夜的灯火，通宵不熄，俗称“光年”。
<p>&nbsp;&nbsp;各地的除夕风俗大致相同，但有些地方的风俗很有特点，如苏州、北京、台湾等。苏州的除夕守岁时，都要等待从枫桥寒山寺传来的洪亮钟声。当钟声穿过沉沉夜色，传到千家万户时，就标志着新春的来临。 无论春夏秋冬，每日半夜正交子时，寒山寺中就会传出这口巨钟的洪响，民间称为“分夜钟”。这口钟，已成为苏州城乡方圆数十里人民生活的时间信息。寒山寺钟声还出现在诗中，流传最广的就是唐代诗人张继的《枫桥夜泊》：月落乌啼霜满天，江枫渔火对愁眠。姑苏城外寒山寺，夜半钟声到客船。
<p>&nbsp;&nbsp;现在，每年除夕，苏州寒山寺仍遵循万古不变的古老习俗，击钟以分岁。姑苏城乡，到了守岁的最后一刻，会从广播中传出宏亮的寒山寺钟声，报导一年的开始。千家万户，听到钟声，爆竹齐鸣，使古老的寒山寺钟声成为了一种时代的象征。北京的除夕这一天更是忙碌，祭祖、接神、接灶。祭神拜祖的仪式一开始，整个北京城便淹没在一片震耳欲聋的爆竹声中。人们还在自己家院子里，铺上芝麻秸，全家人都去踩，叫“踩岁”，取长命百岁的意义。除夕通宵灯火齐明，人们辞岁守岁。当新年的钟声敲响时，各家的饺子也下锅了，人们尽情的娱乐。
<p>&nbsp;&nbsp;除夕在台湾不叫除夕，而叫“过年日”。午后，在厅堂神龛前上供牲体。到了晚上，合家焚香叩拜，然后对长者辞岁。接着是“围炉”，也就是丰盛的年夜饭，一家人围坐一桌，桌上摆满菜肴，桌下放置火盆。“围炉”为除夕带来高潮，远在他乡的游子，除非万不得已，再远再忙也要赶回家团圆。年夜饭后，便高燃蜡炬来守岁，儿媳妇为长辈们添富寿，不能早睡，坐得越久，长辈得富寿越长，这是表示孝心。
<html/>"

    }
    ListElement{
        fest:"春节"
        picture:"chunjie.jpg"
        detail:"春节（农历正月初一），春节是我国重要的传统节日。"
        story:"<html>
<p>&nbsp;&nbsp;相传尧舜时期，我国就有了这个节日。殷商甲骨文的卜辞中，亦有关于春节的记载，有庆祝岁首春节的风俗。但当时的历法，是靠“观象授时”，是否准确，尚难确定。到了汉武帝太初元年，我国人民创造了“太初历”，明确规定以农历正月为岁首。从这时起，农历新年的习俗就流传了2000多年。直到新中国成立，改用公元以后，这个节日就改为春节。
<p>&nbsp;&nbsp;中国人过春节，据说是从原始社会的“腊祭”演变而来的。人们经过一年的辛勤劳动，到了岁末年初，用收获的农猎物祭把众神和祖先，这就是“腊祭”。
<p>&nbsp;&nbsp;扫尘：从农历腊月二十四起，直到除夕，人们都要把房子打扫一遍，并做好个人洗理卫生。
<p>&nbsp;&nbsp;贴春联：春联又叫“对联”、“对子”。每到春节，家家户户都要贴春联。春联起源于桃符。传说古代东海度朔山有棵桃树，树下住着神茶、郁垒二神，管理万鬼。如有鬼作恶，二神就把它捉去喂老虎。老百姓为了驱除鬼怪，过春节时就在桃木板上画上二神的像挂在门上，这就是桃符。后来有人在桃符上写上吉祥的话，久而久之，桃符逐渐演变成对联。春联则表达了人们过春节的喜悦心情和美好愿望，所以至今仍深受人们的喜爱。
<p>&nbsp;&nbsp;贴“福”字：过春节时，人们把写在红纸上大小不同的“福”字贴在门上、柜上、缸上、粮囤上，意思是祈求在新的一年里，福满门庭。还有的人故意把“福”字倒着贴，取“福”到了之意。
<p>&nbsp;&nbsp;守岁：民间历来有过年“守岁”的习俗。除夕之夜全家团聚，通宵不寐，大人叙旧话新，预祝来年万事如意；小孩嬉戏玩耍，燃灯放炮。
<p>&nbsp;&nbsp;吃饺子：过春节吃饺子的习俗，可追溯到南北朝时期，但那时不叫饺子而叫“馄饨”。大约到了清朝，馄饨才真正被称为饺子。清初史书记载：“元旦子时（午夜12点）馔同享，各食扁子，名饺子，取更岁交子之意。”以后又把“交”字加上食字旁，便成了今日的饺子。过去吃饺子是过年的象征。现在吃饺子早已是家常便饭了。但正月初一这一天，人们仍有吃饺子的习惯。
<p>&nbsp;&nbsp;拜年：大年初一人们都要走出家门，亲朋好友，邻居们都互相问好。拜年的习俗源于远古的传说。传说那时，有一种叫“年”的怪兽，每到除夕之夜，都要出来挨家挨户地吃人。人们怕被吃掉，就在除夕到来之前把肉食放到门外，然后紧闭门户，在家躲到初一早晨再出门，出门后见面互相作揖道喜，祝贺没被“年”吃掉。这就是最初的拜年。以后代代相传，成为习俗。到了宋代，有人感到登门拜年，费时费力，改用名帖互相投贺，这就是最早的贺年片。<html/>"}

    ListElement{
        fest:"立春"
        picture:"lichun.jpg"
        detail:"立春，是二十四节气之一，又称“打春”，每年2月4日或5日太阳到达黄经315度时为立春。"
        story:"<html>
<p>&nbsp;&nbsp;《月令七十二候集解》：“正月节，立，建始也，立夏秋冬同。”古代“四立”，指春、夏、秋、冬四季开始，其农业意义为“春种、夏长、秋收、冬藏”，概括了黄河中下游农业生产与气候关系的全过程。立春中国幅员辽阔，地理条件复杂，各地气候相差悬殊，四季长短不一，“四立”虽能反映黄河中下游四季分明的气候特点，“立”的具体气候意义却不显著，不能适用全国各地。黄河中下游土壤解冻日期从立春开始；立春第一候应为“东风解冻”，两者基本一致，但作为春季开始的标志，失之过早。中国气候学上，常以每五天的日平均气温稳定在10℃以上的始日划分为春季开始，它与黄河中下游立春含义不符。 虽然立了春，但是华南大部分地区仍是很冷,“白雪却嫌春色晚，故穿庭树作飞花”的景象。二月上旬，真正进入春季的只有华南。但这种划分方法比较符合实际。立春后气温回升，春耕大忙季节在全国大部分地区陆续开始。立春节气，东亚南支西风急流已开始减弱，隆冬气候已快要结束。但北支西风急流强度和位置基本没有变化，蒙古冷高压和阿留申低压仍然比较强大，大风降温仍是江淮地区盛行的主要天气。但在强冷空气影响的间隙期。偏南风频数增加，并伴有明显的气温回升过程。
<html/>"

    }
    ListElement{
        fest:"情人节"
        picture:"qingrenjie.jpg"
        detail:" 情人节又叫圣瓦伦丁节或圣华伦泰节，即每年的2月14日，是西方的传统节日之一。"
        story:"<html>
<p>&nbsp;&nbsp;这是一个关于爱、浪漫以及花、巧克力、贺卡的节日。男女在这一天互送礼物用以表达爱意或友好。现已成为欧美各国青年人喜爱的节日，其他国家也已开始流行。而在中国，传统节日之一的七夕节也是姑娘们重视的日子，因此而被称为中国的情人节。由于能表达共同的人类情怀，各国各地纷纷发掘了自身的“情人节”。
<p>&nbsp;&nbsp;传说一
<p>&nbsp;&nbsp;公元3世纪，罗马帝国皇帝克劳迪乌斯二世在首都罗马宣布废弃所有的婚姻承诺，当时是出于战争的考虑，使更多无所牵挂的男人可以走上争战的疆场。一名叫瓦仑廷（Sanctus Valentinus）的神父没有遵照这个旨意而继续为相爱的年轻人举行教堂婚礼。事情被告发后，瓦仑廷神父先是被鞭打，然后被石头掷打，最后在公元270年2月14日这天被送上了绞架被绞死。14世纪以后，人们就开始纪念这个日子。现在，中文译为“情人节”的这个日子，在西方国家里就被称为Valentine's Day ，用以纪念那位为情人做主而牺牲的神父。
<p>&nbsp;&nbsp;传说二
<p>&nbsp;&nbsp;据说瓦伦丁是最早的基督徒之一，那个时代做一名基督徒意味着危险和死亡。为掩护其他殉教者，瓦沦丁被抓住，投入了监牢。在那里他治愈了典狱长女儿失明的双眼。当暴君听到着一奇迹时，他感到非常害怕，于是将瓦沦丁斩首示众。据传说，在行刑的那一天早晨，瓦沦丁给典狱长的女儿写了一封情意绵绵的告别信，落款是：From your Valentine（寄自你的瓦伦丁）。当天，盲女在他墓前种了一棵开红花的杏树，以寄托自己的情思，这一天就是2月14日。自此以后，基督教便把2月14日定为情人节。
<p>&nbsp;&nbsp;传说三
<p>&nbsp;&nbsp;在古罗马时期，2月14日是为表示对约娜的尊敬而设的节日。约娜是罗马众神的皇后，罗马人同时将她尊奉为妇女和婚姻之神。接下来的2月15日则被称为“卢帕撒拉节”，是用来对约娜治下的其他众神表示尊敬的节日。
  在古罗马，年轻人和少女的生活是被严格分开的。然而，在卢帕撒拉节，小伙子们可以选择一个自己心爱的姑娘的名字刻在花瓶上。这样，过节的时候，小伙子就可以与自己选择的姑娘一起跳舞，庆祝节日。如果被选中的姑娘也对小伙子有意的话，他们便可一直配对，而且最终他们会坠入爱河并一起步入教堂结婚。后人为此而将每年的2月14日定为情人节。
<p>&nbsp;&nbsp;传说四
<p>&nbsp;&nbsp;来源于古罗马的牧神节（Lupercalia Festival）。这个说法是基督教会庆祝这一天是为了把古罗马的牧神节（每年的2月15日庆祝，为了保佑人、田、牲畜的生产力）基督教化。在罗马人崇拜的众神中，畜牧神卢波库斯（Lupercus）掌管着对牧羊人和羊群的保护。每年二月中，罗马人会举行盛大的典礼来庆祝牧神节。那时的日历与现在相比，要稍微晚一些，所以牧神节实际上是对即将来临的春天的庆祝。也有人说这个节日是庆祝法乌努斯神（Faunus），它类似于古希腊人身羊足，头上有角的潘神（ Pan ），主管畜牧和农业。随着罗马势力在欧洲的扩张，牧神节的习俗被带到了现在的法国和英国等地。
<p>&nbsp;&nbsp;人们最乐此不疲的一项节日活动类似于摸彩。年轻女子们的名字被放置于盒子内，然后年轻男子上前抽取。抽中的一对男女成为情人，时间是一年或更长。基督教的兴起使人们纪念众神的习俗逐渐淡漠。教士们不希望人们放弃节日的欢乐，于是将牧神节（Lupercalia）改成瓦沦丁节（ Valentine's Day），并移至二月十四日。这样，关于瓦沦丁修士的传说和古老的节日就被自然地结合在一起。这一节日在中世纪的英国最为流行。未婚男女的名字被抽出后，他们会互相交换礼物，女子在这一年内成为男子的Valentine。 在男子的衣袖上会绣上女子的名字，照顾和保护该女子于是成为该男子的神圣职责。
<p>&nbsp;&nbsp;爱情的象征-玫瑰
<p>&nbsp;&nbsp;在情人节的习俗中，鲜花和巧克力是庆祝时必不可少的。玫瑰代表爱情是众所周知的，但不同颜色、朵数的玫瑰还另有吉意。
玫瑰：在希腊神话中，玫瑰就是美神的化身。在世界范围内。玫瑰是用来表达爱情的通用语言。玫瑰颇色丰富，不同颜色有着不同的寓意。

<p>不同数量

<p>&nbsp;0朵玫瑰代表——爱你在心口难开！
<p>&nbsp;1朵玫瑰代表——我的心中只有你 ONLY YOU！
<p>&nbsp;2朵玫瑰代表—— 这世界只有我俩！
<p>&nbsp;3朵玫瑰代表—— 我爱你I LOVE YOU！
<p>&nbsp;4朵玫瑰代表—— 至死不渝！
<p>&nbsp;5朵玫瑰代表—— 由衷欣赏！
<p>&nbsp;6朵玫瑰代表—— 互敬 互爱 互谅！
<p>&nbsp;7朵玫瑰代表—— 我偷偷地爱著你！
<p>&nbsp;8朵玫瑰代表—— 感谢你的关怀扶持及鼓励！
<p>&nbsp;9朵玫瑰代表—— 长久 ALWAYS！
<p>&nbsp;10朵玫瑰代表—— 十全十美 无懈可击！
<p>&nbsp;11朵玫瑰代表—— 一生一世只爱你一个！
<p>&nbsp;12朵玫瑰代表—— 对你的爱与日俱增！
<p>&nbsp;13朵玫瑰代表—— 友谊长存！
<p>&nbsp;14朵玫瑰代表—— 骄傲！
<p>&nbsp;15朵玫瑰代表—— 对你感到歉意IM SORRY！
<p>&nbsp;16朵玫瑰代表—— 多变不安的爱情！
<p>&nbsp;17朵玫瑰代表—— 绝望无可挽回的爱！
<p>&nbsp;18朵玫瑰代表—— 真诚与坦白！
<p>&nbsp;19朵玫瑰代表—— 忍耐与期待！
<p>&nbsp;20朵玫瑰代表—— 我仅一颗赤诚的心！
<p>&nbsp;21朵玫瑰象徵—— 真诚的爱！
<p>&nbsp;22朵玫瑰象徵—— 祝你好运！
<p>&nbsp;25朵玫瑰象徵—— 祝你幸福！
<p>&nbsp;30朵玫瑰象徵—— 信是有缘！
<p>&nbsp;36朵玫瑰象徵—— 浪漫！
<p>&nbsp;40朵玫瑰象徵—— 誓死不渝的爱情！
<p>&nbsp;50朵玫瑰象徵—— 邂逅不期而遇！
<p>&nbsp;99朵玫瑰象徵—— 天长地久 FOREVER！
<p>&nbsp;100朵玫瑰象徵—— 百分之百的爱 100% LOVE！
<p>&nbsp;101朵玫瑰象徵—— 最……最爱！
<p>&nbsp;108朵玫瑰象徵—— 求 婚！

<p>不同颜色

<p>&nbsp;粉红色的玫瑰：初恋。
<p>&nbsp;红色的玫瑰：热恋。
<p>&nbsp;橙红色的玫瑰：美丽。
<p>&nbsp;白色的玫瑰：尊敬。
<p>&nbsp;黄色的玫瑰：道歉。
<p>&nbsp;深红色的玫瑰：羞怯。
<p>&nbsp;淡绿色的玫瑰：青春长驻。[1]
<p>&nbsp;巧克力
<p>&nbsp;榛子巧克力——忠贞
<p>&nbsp;果仁巧克力——可人
<p>&nbsp;酒心巧克力——与你共醉
<p>&nbsp;奶香巧克力——我的蜜糖
<p>&nbsp;其他鲜花
<p>&nbsp;红色郁金香——爱的告白。
<p>&nbsp;蔷薇——求爱
<p>&nbsp;满天星——爱怜
<p>&nbsp;百合——百年好和
<p>&nbsp;向日葵——爱慕
<p>&nbsp;合欢——欢乐
<p>&nbsp;金盏花——迷恋
<p>&nbsp;红豆——相思
<p>&nbsp;石斛兰——任性美人
<p>&nbsp;红菊——我爱
<p>&nbsp;紫丁香——羞怯
<p>&nbsp;白丁香——念我
<p>&nbsp;郁金香——爱的寓言
<p>&nbsp;杨柳枝——依恋
<p>&nbsp;紫萝兰——永恒之美
<p>&nbsp;波斯菊——永远快活
<p>&nbsp;玛格丽特——情人的爱
<p>&nbsp;勿忘我——勿忘我有，“花中情种”之称
<p>&nbsp;秋海棠——相思红
<p>&nbsp;月季——爱情的信物、代名词
<html/>
"

    }
    ListElement{
        fest:"雨水"
        picture:"yushui.jpg"
        detail:"公历每年二月十八日前后为雨水节气。"
        story:" <html>
<p>&nbsp;&nbsp;雨水，表示两层意思，一是天气回暖，降水量逐渐增多了，二是在降水形式上，雪渐少了，雨渐多了，《月令七十二候集解》中说：“正月中，天一生水。春始属木，然生木者必水也，故立春后继之雨水。且东风既解冻，则散而为雨矣。”雨水是24节气中的第2个节气。每年的2月19日前后，太阳黄经达330度时，是二十四节气的雨水。此时，气温回升、冰雪融化、降水增多，故取名为雨水。雨水节气一般从2月18日或19日开始，到3月4日或5日结束。雨水和谷雨、小雪、大雪一样，都是反映降水现象的节气。"


    }

    ListElement{
        fest:"元宵节"
        picture:"yuanxiaojie.jpg"
        detail:"为每年农历正月十五日，正月为元月，十五日是一年中第一个月圆之夜，所以称元宵节。又称为“上元节”。"
        story:"<html>
<p>&nbsp;&nbsp;元宵节起源于汉朝，据说是汉文帝时为纪念“平吕”而设。汉惠帝刘盈死后，吕后篡权，吕氏宗族把持朝政。周勃、陈平等人在吕后死后，平除吕后势力，拥立刘恒为汉文帝。因为平息诸吕的日子是正月十五日，此后每年正月十五日之夜，汉文帝都微服出宫，与民同乐以示纪念。并把正月十五日定为元宵节。汉武帝时， “太一神”的祭祀活动在正月十五。司马迁在“太初历”中就把元宵节列为重大节日。
<p>&nbsp;&nbsp;我国民间有元宵节吃元宵的习俗。民间相传，元宵起源于春秋时期的楚昭王。某个正月十五日，楚昭王经过长江，见江面有漂浮物，为一种外白内红的甜美食物。楚昭王请教孔子，孔子说“此浮萍果也，得之主复兴之兆”。元宵和春节的年糕，端午节的粽子一样，都是节日食品。吃元宵象征家庭象月圆一样团圆，寄托了人们对未来生活的美好愿望。元宵在南方称“汤圆”、“圆子”、“浮圆子”、“水圆”，由糯米制成，或实心，或带馅。馅有豆沙、白糖、山楂等等，煮、煎、蒸、炸皆可。
<p>&nbsp;&nbsp;元宵节燃灯的习俗起源于道教的“三元说”；正月十五日为上元节，七月十五日为中元节，十月十五日为下元节。主管上、中、下三元的分别为“天”“地”“人”三官，天官喜乐，故上元节要燃灯。元宵节燃灯放火，自汉朝时已有此风俗，唐时，对元宵节倍加重视；在元宵节燃灯更成为一种习俗。唐朝大诗人卢照邻曾在《十五夜观灯》中这样描述元宵节燃灯的盛况“接汉疑星落，依楼似月悬。”元宵节燃灯的习俗，经过历朝历代的传承，节日的灯式越来越多，灯的名目内容也越来越多，有镜灯、凤灯、琉璃灯等等。元宵节除燃灯之外，还放烟花助兴。
       “猜灯谜”又叫“打灯谜”是元宵节后增的一项活动，出现在宋朝。南宋时，首都临安每逢元宵节时制迷，猜谜的人众多。开始时是好事者把谜语写在纸条上，贴在五光十色的彩灯上供人猜。因为谜语能启迪智慧又饶有兴趣，所以流传过程中深受社会各阶层的欢迎。元宵节除了庆祝活动外，还有信仰性的活动。那就是“走百病”又称“烤百病”“散百病”参与者多为妇女，他们结伴而行或走墙边，或过桥过走郊外，目的是驱病除灾。
<p>&nbsp;&nbsp;随着时间的推移，元宵节的活动越来越多，不少地方节庆时增加了耍龙灯、耍狮子、踩高跷、划旱船扭秧歌、打太平鼓等活动。
<html/>"

    }


}
