// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    //id:janmodel
    ListElement{
        fest:"元旦"
        picture:"yuandanjie.jpg"
        detail:"元旦（New Year's Day）便是一年开始的第一天，也被称为“新历年”、“阳历年”。"
        story:"<html>
<p>&nbsp;&nbsp;“元”有开始之意,“旦”指天明的意思。元旦（New Year's Day ）便是一年开始的第一天，也被称为“新历年”、“阳历年”。元旦又称“三元”，即岁之元、月之元、时之元。辛亥革命成功后，孙中山为了“行夏正，所以顺农时，从西历”，定农历正月初一为春节，而以西历的1月1日为新年。1949年9月27日，中国人民政治协商会议第一届全体会议决定：“中华人民共和国纪年采用公元年法”，确认元旦为中国的法定节日。元旦也是世界上很多国家或地区的法定假日。
<html/>
"

    }
    ListElement{
        fest:"腊八节"
        picture:"labajie.jpg"
        detail:"腊八节是指每年农历的十二月初八；在这一天喝腊八粥。"
        story:"<html>
<p>&nbsp;&nbsp;我国喝腊八粥的的历史，已有一千多年。最早开始于宋代。每逢腊八这一天，不论是朝廷、官府、寺院还是黎民百姓家都要做腊八粥。到了清朝，喝腊八粥的风俗更是盛行。在宫廷，皇帝、皇后、皇子等都要向文武大臣、侍从宫女赐腊八粥，并向各个寺院发放米、果等供僧侣食用。
<p>&nbsp;&nbsp;在民间，家家户户也要做腊八粥，祭祀祖先；同时，合家团聚在一起食用，馈赠亲朋好友。中国各地腊八粥的花样，争奇竞巧，品种繁多。其中以北平的最为讲究，搀在白米中的物品较多，如红枣、莲子、核桃、栗子、杏仁、松仁、桂圆、榛子、葡萄、白果、菱角、青丝、玫瑰、红豆、花生……总计不下二十种。人们在腊月初七的晚上，就开始忙碌起来，洗米、泡果、拨皮、去核、精拣然后在半夜时分开始煮，再用微火炖，一直炖到第二天的清晨，腊八粥才算熬好了。从先秦起，腊八节都是用来祭祀祖先和神灵，祈求丰收和吉祥。据说，佛教创始人释迦牟尼的成道之日也在十二月初八，因此腊八也是佛教徒的节日，称为“佛成道节”。
<html/>
"

    }
    ListElement{
        fest:"黑人节"
        picture:"heirenjie.jpg"
        detail:"每年1月第一个星期日是黑人节 。非洲统一组织赞同，非洲文化协会确定。"
        story:"<html>
<p>&nbsp;&nbsp;这个节日使人想起马丁路德金和他那着著名的“I have a dream”，也许世界和平和人的平等这种大事对孩子来讲还太深奥，但是有些观念是要从小培养的。在适当的时候告诉孩子一些关于人的肤色、种族和地理常识 ，从而让孩子知道世界很大，在很远很远的地方有很多与我们的肤色不相同的人。
<p>&nbsp;&nbsp;在1988年版的电影《发胶》中，女儿特蕾西盼望着能在专门面向青少年的电视舞蹈节目《考林·柯林斯秀》中露露脸，尽管她有一定的舞蹈天赋，可想参加节目还是难于上青天。当时，该节目几乎全由白人掌控着，只有每月一次的“黑人日”才让有色人种参与，然而黑人孩子兴冲冲地来参加节目，却发现给他们的镜头实际上少之又少。在《发胶》的世界里，这绝对不是一个小问题，1988年版的影片、2002年百老汇改编的歌舞剧以及2007年的新版影片都把这个问题看成是头等大事。
<html/>"
    }
    ListElement{
        fest:"法国帝王节"
        picture:"faguodiwangjie.jpg"
        detail:"1月6日是法国帝王节。"
        story:"      <html>
<p>&nbsp;&nbsp;在1801年决定的日期，将在每年的一月六日定为帝王节。以前叫LE GATEAU DES ROIS，因为这天国王会送蛋糕并免税收。现在改叫JOUR DES ROIS，蛋糕的形式也在延续着，蛋糕叫GALETTE。根据地区不同，可能是蛋糕也可能是一种叫BRIOCHE的蛋糕。样子简单，在南部普罗旺斯上面要有一层蜜饯，还有放杏仁的。在蛋糕里面有一个小陶瓷国王，谁吃到在今天看来更是一种幸运。
<html/>"

    }
    ListElement{
        fest:"小寒"
        picture:"xiaohan.jpg"
        detail:"小寒是第二十三个节气，在公历1月5-7日之间，是=一年中最寒冷的日子。"
        story:"<html>
<p>&nbsp;&nbsp;小寒（slight cold），与大寒、小暑、大暑及处暑一样，都是表示气温冷暖变化的节气。《月令七十二候集解》：“十二月节，月初寒尚小，故云。月半则大矣。”小寒的意思是天气已经很冷，中国大部分地区小寒和大寒期间一般都是最冷的时期，“小寒”一过，就进入“出门冰上走”的三九天了。中国古代将小寒分为三候：“一候雁北乡，二候鹊始巢，三候雉始鸲”，古人认为候鸟中大雁是顺阴阳而迁移，此时阳气已动，所以大雁开始向北迁移；此时北方到处可见到喜鹊，并且感觉到阳气而开始筑巢；第三候“雉鸲”的“鸲”为鸣叫的意思，雉在接近四九时会感阳气的生长而鸣叫。
<html/>"
    }
    ListElement{
        fest:"香水节"
        picture:"xiangshuijie.jpg"
        detail:"西方传统节日规定每年1月12日为国际香水节，每逢这个节日，人们都把自己变成香美人并且可以获得自己喜爱的香水。"
        story:"<html>
<p>&nbsp;&nbsp;公元前1500年，埃及艳后克娄巴特拉奥(Cleopatra)经常使用15种不同气味的香水和香油来洗澡，甚至还用香水来浸泡她的船帆。香水是身份和地位的象征。在皇宫里，最香的必定是皇上，当时人们喜欢把香水涂在任何地方，马的身上，甚至造墙的砂浆中。
<p>&nbsp;&nbsp;古埃及时期，在公共场所中不涂香水是违法的，当时每年1月12日调香师们把最好的香水贡献给皇上，随着香水的发展，西方传统节日规定每年1月12日为国际香水节，每逢这个节日，人们都把自己变成香美人并且可以获得自己喜爱的香水。
<html/>"

    }
    ListElement{
        fest:"成人节"
        picture:"chengrenjie.jpg"
        detail:"成人节的日期为每年1月第二周的星期一。是日本非常重要的传统节日之一。"
        story:"<html>
<p>&nbsp;&nbsp;1948年，日本政府根据民俗规定满20岁的人要过“成人式”，目的是要让青年意识到自己已成为社会的正式成员.凡年满20岁的男女青年在成人节这天要身穿传统服装参加官方或民间团体为他们举办的成人仪式，内容包括年轻人宣誓、长者的祝贺和参拜神社以及参加各种传统的文娱活动等。从此之后，他们可以吸烟、喝酒和结婚。而违法则要负全责。
<p>&nbsp;&nbsp;日本的成人节源于古代的成人仪礼，而日本古代的成人仪礼受到过中国“冠礼”的影响，所谓“冠礼”，指男子成年时举行的一种加冠的礼仪。从加冠这天起，冠者便被社会承认为已经成年。日本仿中国旧礼制，始行加冠制度在天武天皇十一年（公元683年）。按中国古代阴阳学说，冠日多选甲子、丙寅吉日，特别以正月为大吉。
<html/>"

    }
    ListElement{
        fest:"大寒"
        picture:"dahan.jpg"
        detail:"大寒是二十四节气之一最后一个节气。"
        story:"<html>
<p>&nbsp;&nbsp;每年1月20日前后太阳到达黄经300°时为大寒。
<p>&nbsp;&nbsp;《月令七十二候集解》：“十二月中，解见前（小寒）。”《授时通考·天时》引《三礼义宗》：“大寒为中者，上形于小寒，故谓之大……寒气之逆极，故谓大寒。”这时寒潮南下频繁，是中国大部分地区一年中的最冷时期，风大，低温，地面积雪不化，呈现出冰天雪地、天寒地冻的严寒景象。这个时期，铁路、邮电、石油、海上运输等部门要特别注意及早采取预防大风降温、大雪等灾害性天气的措施。农业上要加强牲畜和越冬作物的防寒防冻大寒，是天气寒冷到极点的意思。《授时通考·天时》引《三礼义宗》：“大寒为中者，上形于小寒，故谓之大......寒气之逆极，故谓大寒。”这时寒潮南下频繁，是我国大部地区一年中的寒冷时期，风大，低温，地面积雪不化，呈现出冰天雪地、天寒地冻的严寒景象。大寒是中国二十四节气最后一个节气，过了大寒，又迎来新一年的节气轮回。
<html/>"

    }
}
