// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"建党节"
        picture:"jiandangjie.jpg"
        detail:"中国共产党成立纪念日，每年公历七月一日。"
        story:"<html>
<p>&nbsp;&nbsp;1917年俄国十月革命胜利后，马克思主义建党节迅速传遍我国，经过“五四”爱国运动，最早接受马列主义的革命知识分子李大钊，陈独秀，毛泽东，董必武等人，相继在各地成立共产主义小组，宣传马列主义，从事工人运动。
<p>&nbsp;&nbsp;在列宁领导的共产国际的积极帮助下，1921年7月各地共产主义小组派出代表到上海召开了中国共产党第一次代表大会。后因被帝国主义密探发觉，会议又转移到浙江嘉兴南湖的一只游船上继续进行。参加会议的有李达，李汉俊，张国焘，刘仁静，董必武，陈潭秋，毛泽东，何叔衡，王尽美，邓恩铭，陈公博，周佛海，共十二名。代表全国各界五十七名党员出席了会议。包惠僧受陈独秀派遣，出席了会议。参加会议的还有共产国际代表马林，赤色职工国际代表尼柯尔斯基。大会通过了党的章程，选举陈独秀为总书记，宣告中国共产党成立。从此，在中国出现了完全新式的以共产主义为目的，以马列主义为行动指南的，统一的工人阶级政党。
<p>&nbsp;&nbsp;中国共产党的诞生，开辟了中国历史发展的新时代，使中国革命的面貌焕然一新。抗日战争时期，由于环境困难，不能查记“一大”召开的准确日期（后经过考证，得出“一大”召开的时间为1921年7月23日），因此1941年党中央决定召开“一大”确定1921年7月的首日即7月1日作为党的生日和纪念日。<html/>"

    }
    ListElement{
        fest:"小暑"
        picture:"xiaoshu.jpg"
        detail:"小暑(Lesser Heat)，二十四节气之第十一节气。"
        story:"<html>
<p>&nbsp;&nbsp;每年7月7日或8日，太阳到达黄经105°时为小暑。
<p>&nbsp;&nbsp;《月令七十二候集解》：“六月节……暑，热也，就热之中分为大小，月初为小，月中为大，今则热气犹小也。”暑，表示炎热的意思，小暑为小  小暑养生热，还不十分热。意指天气开始炎热，但还没到最热，全国大部分地区基本符合。这时江淮流域梅雨即将结束，盛夏开始，气温升高，并进入伏旱期；而华北、东北地区进入多雨季节，热带气旋活动频繁，登陆我国的热带气旋开始增多。小暑后南方应注意抗旱，北方须注意防涝。全国的农作物都进入了茁壮成长阶段，需加强田间管理。小暑的标志;出梅。入伏。<html/>"

    }
    ListElement{
        fest:"大暑"
        picture:"dashu.jpg"
        detail:"大暑，二十四节气之一。在每年的7月23日或24日，太阳到达黄经120°。"
        story:"<html>
<p>&nbsp;&nbsp;《月令七十二候集解》：“六月中，……暑，热也，就热之中分为大小，月初为小，月中为大，今则热气犹大也。”这时正值“中伏”前后，是一年中最热的时期，气温最高，农作物生长最快，大部分地区的旱、涝、风灾也最为频繁，抢收抢种，抗旱排涝防台和田间管理等任务很重。民间有饮伏茶，晒伏姜，烧伏香等习俗。<html/>"

    }

}

