// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"儿童节"
        picture:"ertongjie.jpg"
        detail:"国际儿童节（又称儿童节，International Children's Day）定于每年的6月1日。"
        story:"<html>
<p>&nbsp;&nbsp;为了悼念利迪策惨案和全世界所有在战争中死难的儿童，反对虐杀和毒害儿童，以及保障儿童权利1949年11月，国际民主妇女联合会在莫斯科举行理事会议，中国和各国代表愤怒地揭露了帝国主义分子和各国反动派残杀、毒害儿童的罪行。会议决定以每年的6月1日为国际儿童节。它是为了保障世界各国儿童的生存权、保健权和受教育权，抚养权，为了改善儿童的生活，为了反对虐杀儿童和毒害儿童而设立的节日。目前世界上许多国家都将6月1日定为儿童的节日。
<p>&nbsp;&nbsp;1950年6月1日，新中国的小主人们迎来了第一个国际儿童节。
<p>&nbsp;&nbsp;儿童是祖国的未来。但是，解放前，广大劳动人民的子女却被剥夺了接受教育的权利，也被剥夺了欢乐的童年。新中国成立后，党和政府非常重视儿童的健康成长。尽管解放初期物质条件不足，困难重重，党中央还是重视儿童的全面发展。1949年11月，国际民主妇联理事会决定，6月1日为国际儿童节。刚成立不久的中华人民共和国中央人民政府，决定将这一天定为中国儿童的节日。党中央对新中国的第一个儿童节非常重视。为了筹备庆祝六一儿童节，响应民主妇联等团体发出的“保卫儿童权利、争取和平”呼吁书，我国11个人民团体和中央人民政府有关部门，专门组成了筹备委员会。毛泽东挥笔题词：“庆祝儿童节”。朱总司令殷切地希望：“新中国的儿童，要爱祖国、爱科学、爱劳动，准备好好的建设新中国。”刘少奇、周恩来、宋庆龄、邓颖超等党和国家领导人也为孩子们题词。
<p>&nbsp;&nbsp;这一天，5000名儿童聚集在北京中山公园音乐堂，庆祝自己的节日，苏联、朝鲜等国家的小朋友和母亲们，也应邀出席了联欢会。朱总司令非常关心孩子们的健康成长，他说：“你们的年龄，现在虽然还小，但要努力学习，学会各种科学知识，并把自己的身体锻炼得强壮，准备参加建设新中国的工作，把贫穷的落后的中国变成有高度文化的强大工业基础的中国。”
<p>&nbsp;&nbsp;这一天，全国各地的小朋友，也都举行了联欢活动。从这以后，每到“六一”，全国各地都组织各种形式的活动，庆祝少年儿童的节日，党和政府都非常关心少年儿童的健康成长，为他们的生活和学习创造了良好的环境，新中国的孩子们在党的阳光下茁壮成长。
<html/>"

    }
    ListElement{
        fest:"芒种"
        picture:"mangzhong.jpg"
        detail:"芒种是二十四节气之一，一般在6月6日前后，太阳到达黄经75°的时候。"
        story:"<html>
<p>&nbsp;&nbsp;芒种忙种芒种，是农作物成熟的意思。芒种是二十四节气中的第九个节气。在每年的6月5日左右，太阳到达黄经75°时为芒种。《月令七十二候集解》：“五月节，谓有芒之种谷可稼种矣”。意指大麦、小麦等有芒作物种子已经成熟，抢收十分急迫。晚谷、黍、稷等夏播作物也正是播种最忙的季节，故又称“芒种”。春争日，夏争时，“争时”即指这个时节的收种农忙。人们常说“三夏”大忙季节，即指忙于夏收、夏种和春播作物的夏管。所以，“芒种”也称为“忙种”“忙着种”，是农民朋友的散播播种。“芒种”到来预示着农民开始了忙碌的田间生活。
<p>&nbsp;&nbsp;芒种是表征麦类等有芒作物的成熟，是一个反映农业物候现象的节气。时至芒种四川盆地麦收季节已经过去，中稻、红苕移栽接近尾声。大部地区中稻进入返青阶段，秧苗嫩绿，一派生机。“东风染尽三千顷，折鹭飞来无处停”的诗句，生动的描绘了这时田野的秀丽景色。到了芒种时节，盆地内尚未移栽的中稻，应该抓紧栽插；如果再推迟，因气温提高，水稻营养生长期缩短，而且生长阶段又容易遭受干旱和病虫害，产量必然不高。红苕移栽至迟也要赶在夏至之前；如果栽苕过迟，不但干旱的影响会加重，而且待到秋来时温度下降，不利于薯块膨大，产量亦将明显降低。农谚“芒种忙忙栽”的道理就在这里。
<html/>"

    }
    ListElement{
        fest:"父亲节"
        picture:"fuqinjie.jpg"
        detail:"在这天全球有52个国家和地区是在6月在庆祝父亲节。"
        story:"<html>
<p>&nbsp;&nbsp;每个国家的父亲节日期都不尽相同，也有各种的庆祝方式，大部分都与赠送礼物家族聚餐或活动有关。世界上的第一个父亲节，1910年诞生在美国。
<p>父亲节创始人
<p>&nbsp;&nbsp;华盛顿一位叫布鲁斯-多德的夫人，在庆贺母亲节的时候突然产生了一个念头：既然有母亲节，为什么不能有父亲节呢?多德夫人和她的5个弟弟早年丧母，他们由慈爱的父亲一手养大的。许多年过去了，姐弟6人每逢父亲的生辰忌日，总会回想起父亲含辛茹苦养家的情景。在拉斯马斯博士的支持下，她提笔给州政府写了一封措辞恳切的信，呼吁建立父亲节，并建议将节日定在6月5日她父亲生日这天。州政府采纳了她的建议，仓促间将父亲节定为19日，即1909年6月第3个星期日。翌年，多德夫人所在的斯波堪市正式庆祝这一节日，市长宣布了父亲节的文告，定这天为全州纪念日。以后，其他州也庆父亲节。
<p>&nbsp;&nbsp;在父亲节这天，人们选择特定的鲜花来表示对父亲的敬意。人们采纳了多德夫人的建议，佩戴红玫瑰向健在的父亲们表示爱戴，佩戴白玫瑰对故去的父亲表示悼念。后来在温哥华，人们选择了佩戴白丁香，宾夕法尼亚人  父与子用蒲公英向父亲表示致敬。
<p>&nbsp;&nbsp;为了使父亲节规范化，各方面强烈呼吁议会承认这个节日。1972年，尼克松总统正式签署了建立父亲节的议会决议。这个节日终于以法律的形式确定了下来，并一直沿用至今。
"

    }
    ListElement{
        fest:"夏至"
        picture:"xiazhi.jpg"
        detail:"夏至是二十四节气之一，在每年公历6月21日或22日。"
        story:"<html>
<p>&nbsp;&nbsp;夏至这天，太阳直射北回归线(北纬23°26′28″44)，北半球的白昼达最长，在北极圈内甚至会出现极昼现象。是北半球一年中白昼最长的一天，南方各地从日出到日落大多为十四小时左右。夏至这天虽然白昼最长，太阳角度最高，但并不是一年中天气最热的时候。因为，接近地表的热量，这时还在继续积蓄，并没有达到最多的时候。俗话说“热在三伏”，真正的暑热天气是以夏至和立秋为基点计算的。大约在七月中旬到八月中旬，我国各地的气温均为最高，有些地区的最高气温可达40℃左右。
       夏至，古时又称“夏节”、“夏至节”。古时夏至日，人们通过祭神以祈求灾消年丰。《周礼•春官宗伯第三•司巫/神仕》载：“以夏日至致地示物鬼，以禬国之凶荒、民之札丧。”周代夏至祭神，意为清除疫疠、荒年与饥饿死亡。《史记•封禅书》记载：“夏至日，祭地，皆用乐舞。”夏至作为古代节日，宋朝在夏至之日始，百官放假三天，辽代则是“夏至日谓之‘朝节’，妇女进彩扇，以粉脂囊相赠遗”（《辽史》），清朝又是“夏至日为交时，日头时、二时、末时，谓之‘三时’，居人慎起居、禁诅咒、戒剃头，多所忌讳……”（《清嘉录》）。
<p>&nbsp;&nbsp;夏至接近远日点，冬至接近近日点，且近日点地球公转速度快，远日点地球公转速度慢，夏长冬短由此得来。“不过夏至不热”，“夏至三庚数头伏”。夏至虽表示炎热的夏天已经到来，但还不是最热的时候，夏至后的一段时间内气温仍继续升高，大约再过二三十天，一般是最热的天气了。过了夏至，我国南方这时往后常受副热带高压控制，出现伏旱。华南西部雨水量显著增加，使入春以来华南雨量东多西少的分布形势，逐渐转变为西多东少。如有夏旱，一般这时可望解除。近三十年来，华南西部6月下旬出现大范围洪涝的次数虽不多，但程度却比较严重。因此，要特别注意作好防洪准备。夏至节气是华南东部全年雨量最多的节气，为了增强抗旱能力，夺取农业丰收，在这些地区，抢蓄伏前雨水是一项重要措施。
"

    }
    ListElement{
        fest:"端午节"
        picture:"duanwujie.jpg"
        detail:"端午节是每年阴历五月初五，人们要赛龙舟、吃粽子、踏青采艾蒿等。"
        story:"<html>
<p>&nbsp;&nbsp;端午节（Dragon Boat Festival或Double Fifth Festival）又称为端阳节，为每年的农历5月初五日，在湖北、湖南、贵  赛龙舟州、四川一带，端午节又分为大端午与小端午。小端午为每年农历五月初五，大端午为每年农历五月十五日。
<p>&nbsp;&nbsp;时至今日，端午节在中国人民中仍是一个十分盛行的隆重节日。国家非常重视非物质文化遗产的保护，2006年5月20日，该民俗经国务院批准列入第一批国家级非物质文化遗产名录。
       2009年9月30日在阿联酋首都阿布扎比召开的联合国教科文组织保护非物质文化遗产政府间委员会会议决定：中国端午节成功入选《世界人类非物质文化遗产代表作名录》。
<p>&nbsp;&nbsp;若说到端午节的来历，人们首先就会想到爱国诗人屈原。相传战国时，楚襄王宠信奸佞，屈原因仗义直言遭革职放逐。秦国趁机进攻楚国，楚地千里疆域毁于一旦。眼见国破家亡，百姓流离失所，屈原是有心报国而无力回天，愤然之下，屈原抱巨石投汩罗江而去。当地百姓闻听屈原投江，纷纷前来救助，他们顺流而下，一直追到洞庭湖，也未寻见屈原的尸体，湖面上舟船往来穿梭百舸争游的场景蔚为壮观。这一日正是阴历五月初五日。后来，每逢这一天，人们就在江河上赛龙舟，意在怀念屈原。人们还把粽子投入水里，只为了喂饱鱼龙虾蟹，保全屈原的尸身不被吞食。
<html/>"

    }

}
