// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
//    id:janmodel
    ListElement{
        fest:"惊蛰"
        picture:"jingzhe.jpg"
        detail:"惊蛰是二十四节气之一，一般在每年的3月5日或6日。"
        story:"<html>
<p>&nbsp;&nbsp;惊蛰图示为“惊蛰”。惊蛰的意思是天气回暖，春雷始鸣，惊醒蛰伏于地下冬眠的昆虫。“蛰”是藏的意思。《月令七十二候集解》中说：“二月节，万物出乎震，震为雷，故曰惊蛰。是蛰虫惊而出走矣。”晋代诗人陶渊明有诗曰：“促春遘（gòu）时雨，始雷发东隅（yú），众蛰各潜骇，草木纵横舒。”实际上，昆虫是听不到雷声的，大地回春，天气变暖才是使它们结束冬眠，“惊而出走”的原因。 我国各地春雷始鸣的时间早迟各不相同，就多年平均而言，云南南部在1月底前后即可闻雷，而北京的初雷日却在4月下旬。“惊蛰始雷”的说法则与沿江江南地区的气候规律相吻合。<html/>"

    }

    ListElement{
        fest:"妇女节"
        picture:"funvjie.jpg"
        detail:"3.8国际妇女节是全世界妇女的节日，被很多国家确定为法定假日。"
        story:"<html>
<p>&nbsp;&nbsp;国际劳动妇女节的全称是“联合国妇女权益和国际和平日”，又称“国际妇女节”、“三八节”和“三八妇女节”。从1909年3月8日，美国芝加哥妇女争取“男女平等”游行集会以来，至今已走过了百余年历程。中国妇女和世界各国妇女一样，都为国家独立、解放、革命、建设作出了巨大贡献和牺牲，为世界和平和人类发展进步做出了巨大贡献和牺牲。涌现出了数以万计的巾帼英雄和“三八红旗手”。党和政府为维护保护广大妇女的合法权益，制定了较完善的法律法规和规章制度。
饶有情趣的世界妇女节
       三八妇女节3月8日，是国际妇女节，但是在世界各地，除了“三八”以外， 国际劳动妇女节，还有许多专属女性的节日，而且几乎是每个月都有。掌权日每年的1月4日，是瑞士某些地区的“妇女掌权日”，在为期4天的节日中，家里大小事务全由妇女说了算，男人统统“闭幕”。

求爱日每逢闰2月29日这天，是英国旧俗中的“妇女求爱日”。这一天，妇女可以摆脱世俗的清规戒律，大胆向意中人或未拿定主意的情人示意。
女市长节西班牙的“女市长节”，也在2月份。当日，由女性主持市政公务，发号施令，男人如违抗，就会被公众群起攻之。
少女节3月3日是日本的“少女节”，又称“姑娘节”，是全国性的节日。日本人认为，这时正值红桃报春，是女性美的象征，所以也叫“桃花节”。
妈妈节4月，在尼泊尔有一个历时3天的妇女节，来自各地的妇女，披着红色“纱笼”，成群结队地涌向首都加德满都的帕苏帕蒂庙。她们在吃饱了由丈夫烹煮的美食后，便在神像前大唱赞歌。在印度，这个月有一个“妈妈节”。这一天，已为人母者穿上彩色缤纷的“纱笼”，带上各种首饰，显得风姿绰约。这日也是一年中她们最受尊重的一天。
母亲节5月的第二个星期日，是美国、加拿大和欧洲一些国家的母亲节，其主要内容是尊敬母亲。这一天，美国的家庭成员要按习惯佩戴石竹花，做一些使母亲高兴的事。
5月29日，是中非的“妈妈纪念“三八”妇女节100周年大会节”、母亲要带着孩子参加游行。
5月的第三个星期日，是西班牙的“百女节”，订了婚还未过门的少女们持花登高，互相祝福。
太太节8月23日至9月15日，是德国汉堡的“太太节”。由妇女组成的演艺团体，专演一些宣传男女平等的戏，以示庆祝。8月12日，则是泰国的“母亲节”。
狂欢节10月10日至15日，是德国莱茵地区的“妇女狂欢节”。在此期间，妇女“大自由”。男人们不得查探妇女活动的内容，违者会被抓问罪。10月17日，是非洲马拉维共和国的妇女节，这一天有全国性庆典，男人在当天要对妻子呵护有加，侍侯周到。
休息日12月31日到第二天中午，是希腊的“主妇休息日”。这天，妇女在家里什么也不干，一切家务全由男人承担。
南非妇女节南非妇女节时间与国际妇女节不同，1956年8月9日，数百名黑人妇女在比勒陀利亚举行示成游行，抗议当局推行种族隔用离的“通行证法”。为了纪念南非妇女在争取平等斗争中做出的贡献，断南非政府将这一天定为妇女节，并将这一天定为全国公休日。"

    }
    ListElement{
        fest:"龙抬头"
        picture:"longtaitou.jpg"
        detail:"龙抬头，是每年农历二月初二，俗称青龙节。"
        story:"<html>
<p>&nbsp;&nbsp;名曰“龙头节”。俗话说：“二月二，龙抬头，大家小户使耕牛。”此时，阳气回升，大地解冻，春耕将始，正是运粪备耕之际。传说此节起源于三皇之首伏羲氏时 期。伏羲氏“重农桑，务耕田”，每年二月二这天，“皇娘送饭，御驾亲耕”，自理一亩三分地。后来黄帝、唐尧、虞舜、夏禹纷纷效法先王。到周武王，不仅沿袭 了这一传统作法，而且还当作一项重要的国策来实行。于二月初二，举行重大仪式，让文武百官都亲耕一亩三分地，这便是龙头节的历史传说。又一说为武则天废唐 立周称帝，惹得玉帝大怒，命令龙王三年不下雨。龙王不忍生灵涂炭，偷偷降了一场大雨。玉帝得知便将龙王打出天宫，压于大山之下，黎民百姓感龙王降雨深恩， 天天向天祈祷，最后感动了玉皇大帝，于二月初二将龙王释放，于是便有了“二月二，龙抬头”之说。实际上是过去农村水利条件差，农民非常重视春雨，庆祝“龙 头节”，以示敬龙祈雨，让老天保佑丰收，从其愿望来说是好的，故“龙头节”流传至今。<html/>"

    }
    ListElement{
        fest:"植树节"
        picture:"zhishujie.jpg"
        detail:"每年3月1 2日植树节，大家总会挥汗如雨地大植、特植树木。"
        story:"<html>
<p>&nbsp;&nbsp;“植树节”是一些国家以法律形式规定的以宣传森林效益，并动员群众参加造林为活动内容的节日。按时间长短可分为植树日、植树周或植树月，总称植树节。通过这种活动，激发人们爱林、造林的感情，提高人们对森林功用的认识，促进国土绿化，达到爱林护林和扩大森林资源、改善生态环境的目的。是为了动员全民植树而规定的节日。我国的植树节开始时是为纪念孙中山先生逝世，1979年2月23日，我国第五届全国人大常务委员会第六次会议决定，仍以3月12日为中国的植树节，以鼓励全国各族人民植树造林，绿化祖国，改善环境，造福子孙后代。<html/>"

    }
    ListElement{
        fest:"白色情人节"
        picture:"baiseqingrenjie.jpg"
        detail:"白色情人节（英语：White Day；日语：ホワイトデー；）。"
        story:"<html>
<p>&nbsp;&nbsp;3月14日是白色情人节。白色情人节流行于日本、中国台湾等地区，是我们所知道的西方情人节的延续，在送礼方面也不同：具体为2月14日男方送女方一份礼物，主要是玫瑰花或者巧克力。（中国大陆和英美法）3月1日白色情人节，就该轮到女方送男方礼物了。（日本，中国台湾是刚好相反的，2月14日是女生送巧克力，3月14日是男生回礼~） 在日本，通常欲告白的女方会在情人节（2月14日）的时候送礼给心仪的对象，而收到礼物的一方，则会在3月14日回礼并告诉女方自己的心意。亚洲部分地区的年轻人亦会庆祝这个节日。又叫返情人节，指的是在情人节收到礼物，则在一个月后的3月14日回馈礼物，当然仅仅是回馈你想回的那个人。<html/>"

    }
    ListElement{
        fest:"消费者权益日"
        picture:"xiaofeizhequanyiri.jpg"
        detail:"“国际消费者权益日” 定于每年的3月15日，目的在于扩大消费者权益保护的宣传。"
        story:"<html>
<p>&nbsp;&nbsp;1898年全世界第一个消费者组织在美国成立，1936年，建立了全美的消费者联盟。第二次世界大战后，各种反映消费者利益和要求的组织，在一些发达国家相继出现。在此基础上，1960年，国际消费者联盟组织宣告成立。之后，消费者运动更加活跃，许多发展中国家也建立了消费者组织，使消费者运动成为一种全球性的社会现象。目前，全世界已有90多个国家共300 多个消费者组织在开展活动。
       1962年3月15日，肯尼迪在美国国会发表了有关保护消费者利益的总统特别咨文，首次提出了著名的消费者的4项权利，即安全消费的权利、消费时被告知基本事实的权利、选择的权利和呼吁的权利。随着消费者权利保护工作的开展，肯尼迪提出的4项权利和国际消费者协会确定的另外4项权利，即满足基本需求的权利、公正解决纠纷的权利、掌握消费基本知识的权利和在健康环境中生活工作的权利，一并成为全世界保护消费者权益工作的8条准则。<html/>"

    }

    ListElement{
        fest:"春分"
        picture:"chunfen.jpg"
        detail:"春分，昼夜平分之意，排二十四节气之四。"
        story:"<html>
<p>&nbsp;&nbsp;在实务上通常特指太阳真正位于黄经0°的那天：3月20日或3月21日。
<p>&nbsp;&nbsp;在时间周期上是指太阳位于黄经 0°和15°度之间的位置，大约是3月20日至4月5日之间。春分时，太阳直射点在赤道上，此后太阳直射点继续北移，故春分也称升分。春分时，从理论上说，全球昼夜等长（参见晨昏蒙影）。春分之后，北半球各地昼渐长夜渐短，南半球各地夜渐长昼渐短。
<p>&nbsp;&nbsp;春分时，全球无极昼极夜现象。春分之后，北极附近开始极昼，范围渐大；南极附近极昼结束，极夜开始，范围渐大，此时太阳直射赤道，春暖花开，莺飞草长，宜农作，田间管理；观光出游等。
<p>春分的计算
<p>&nbsp;&nbsp;[Y*D+C]-L
<p>&nbsp;&nbsp;公式解读：年数的后2位乘0.2422加20.646取整数减闰年数。21世纪春分的C值=20.646。
<p>&nbsp;&nbsp;举例说明：2092年春分日期=[92×0.2422+20.646]-[92/4]=42-23=19，3月19日是春分。
<p>&nbsp;&nbsp;例外：2084年的计算结果加1日。
<html/>"

    }
    ListElement{
        fest:"复活节"
        picture:"fuhuojie.jpg"
        detail:"复活节是一个西方的重要节日，在每年春分月圆之后第一个星期日。"
        story:"<html>
<p>&nbsp;&nbsp;复活节是纪念耶稣复活，也是基督教最重要的一个节日。据圣经记载，上帝的儿子耶稣降生在马槽里，当他三十岁的时候，挑选十二个学生，开始传道工作。三年半中，他医病、传道、赶鬼，帮助各样有需要的人，将天国的道理说给人听。一直到上帝所安排的时候到了，耶稣基督被门徒犹大出卖，被捉拿、审问，被罗马兵丁钉死在十字架上，临死前曾预言三日后必复活。果然在第三日，耶稣复活了！按圣经的解释，耶稣基督乃道成肉身的圣子，来世上为要赎世人的罪，成为世人的代罪羔羊，这也是为什么复活节如此重要了。 　　耶稣虽然像犯人一样被钉十字架，他死并不是因为他有罪，而是要按上帝的计划替世人赎罪。现在他从死里复活，表示他为我们赎罪成功。任何人只要信靠他，向他认罪，就可得上帝赦免。而耶稣的复活，代表他胜过了死亡，所以凡是信靠他的人，都有永生，就是可以永远和耶稣在一起。因为，耶稣现在仍然活着，所以他听得见我们向他的祷告，会看顾我们每天的生活，赐力量给我们，让每一天都充满了希望。他现在仍然活着，天天与我们在一起。<html/>"

    }
}


