// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1
ListModel{
    ListElement{
        fest:"劳动节"
        picture:"laodongjie.jpg"
        detail:"五一国际劳动节，在每年的5月1日，是全世界劳动人民的共同节日。"
        story:"<html>
<p><p>&nbsp;&nbsp;关于“五一节的由来”是这样的：
       此节源于美国芝加哥的工人大罢工。1886年5月1日，芝加哥的20多万工人为争取实行八小时工作制而举行大罢工，经过艰苦的流血斗争，终于获得了胜利。为纪念这次工人运动，1889年7月14日，由各国马克思主义者召集的社会主义者代表大会，在法国巴黎隆重开幕。大会上，与会代表一致同意：把５月１日定为国际无产阶级的共同节日。这一决议得到世界各国工人的积极响应。1890年5月1日，欧美各国的工人阶级率先走上街头，举行盛大的示威游行与集会，争取合法权益。从此，每逢这一天世界各国的劳动人民都要集会、游行，以示庆祝。
       我国人民庆祝劳动节的活动可追溯至1918年。是年，一些革命的知识分子在上海、苏州等地向群众散发介绍“五一”的传单。1920年5月1日，北京、上海、广州等城市的工人群众走上街头举行了声势浩大的游行、集会。新中国成立后，我国于1949年12月将“五一”定为法定的劳动节。
       1992年“五一”前夕，在北京的共产主义小组成员邓中夏等人创办的长辛店劳动补习学校里，工人们学唱《五一纪念歌》。其歌词是：“美哉自由，世界明星，拼吾热血，为他牺牲，要把强权制度一切扫除净，记取五月一日之良辰。红旗飞舞，走光明路，各尽所能，各取所需，不分贫富贵贱，责任唯互助，愿大家努力齐进取。”这首雄壮有力的歌，是由长辛店劳动实习学校的教员和北京大学进步学生共同创骗而成的。
<html/>"

    }
    ListElement{
        fest:"青年节"
        picture:"qingnianjie.jpg"
        detail:"五四青年节，是为纪念1919年5月4日爆发的五四运动而设立的。"
        story:"<html>
<p><p>&nbsp;&nbsp;1918年11月11日，延续4年之久的第一次世界大战以英、美、法等国的胜利和德、奥等国的失败而告结束。1919年1月，获胜的协约国在巴黎凡尔赛宫召开和平会议。中华民国作为战胜国参加会议。中华民国代表在会上提出废除外国在华特权，取消二十一条等正当要求，均遭拒绝。会议竟决定日本接管德国在华的各种特权。对这丧权辱国的条约，中华民国代表居然准备签字承认。消息传来，举国震怒，群情激愤。以学生为先导的五四爱国运动就如火山爆发一般地开始了。
       1919年5月1日，北京大学的一些学生获悉和会拒绝中国要求的消息。当天，学生代表就在北大西斋饭厅召开紧急会议，决定5月3日在北大法科大礼堂举行全体学生临时大会。
       上海响应北京断而运动5月3日晚，北京大学学生举行大会，高师、法政专门、高等工业等学校也有代表参加。学生代表发言，情绪激昂，号召大家奋起救国。最后定出四条办法，其中就有第二日齐集天安门示威的计划。这四条办法是：（一）联合各界一致力争；（二）通电巴黎专使，坚持不在和约上签字；（三）通电各省于5月7日国耻纪念举行游行示威运动；（四）定于5月4日（星期日）齐集天安门举行学界之大示威。
       5月4日，北京三所高校的3000多名学生代表冲破军警阻挠，云集天安门，他们打出“还我青岛”、
       “收回山东权利”、“拒绝在巴黎和会上签字”、“废除二十一条”、“抵制日货”、“宁肯玉碎，勿为瓦全”、“外争国权，内惩国贼”等口号，并且要求惩办交通总长曹汝霖、币制局总裁陆宗舆、驻日公使章宗祥，学生游行队伍移至曹宅，痛打了章宗祥，并火烧曹宅，引发“火烧赵家楼”事件。随后，军警给予镇压，并逮捕了学生代表32人。
       被学生烧掉的赵家楼学生游行活动受到广泛关注，各界人士给予关注和支持，抗议逮捕学生，北京军阀政府颁布严禁抗议公告，大总统徐世昌下令镇压。但是，学生团体和社会团体纷纷支持。11日，上海成立学生联合会。14日，天津学生联合会成立。广州，南京，杭州，武汉，济南的学生和工人也给予支持。5月19日，北京各校学生同时宣告罢课，并向各省的省议会、教育会、工会、商会、农会、学校、报馆发出罢课宣言。天津、上海、南京、杭州、重庆、南昌、武汉、长沙、厦门、济南、开封、太原等地学生，在北京各校学生罢课以后，先后宣告罢课，支持北京学生的斗争。
        五四青年节海报为了使青年继承和发扬五四运动的光荣传统，1939年，陕甘宁边区西北青年救国联合会规定5月4日为中青年节。1949年12月23日，中国人民政府政务院正式规定：5月4日为中国青年节。
       按照国务院公布的《全国年节及纪念日放假办法》的规定，“青年节（5月4日），14周岁以上的青年放假半天”，但这一规定没有明确放假适用人群的年龄上限。
<html/>"

    }
    ListElement{
        fest:"立夏"
        picture:"lixia.jpg"
        detail:"每年5月5日或5月6日是农历的立夏。"
        story:"<html>
<p><p><p>&nbsp;&nbsp;立夏以后，江南正式进入雨季，雨量和雨日均明显增多，连绵的阴雨不仅导致作物的湿害。还会引起多种病害的流行。小麦抽穗扬花是最易感染赤霉病的时期，若预计未来有温暖但多阴雨的天气，要抓紧在始花期到盛花期喷药防治。南方的棉花在阴雨连绵或乍暖乍寒的天气条件下，往往会引起炭疽病、立枯病等病害的暴发，造成大面积的死苗、缺苗。应及时采取必要的增温降湿措施，并配合药剂防治，以保全苗争壮苗。“多插立夏秧，谷子收满仓”，立夏前后正是大江南北早稻插秧的火红季节。“能插满月秧，不薅满月草”，这时气温仍较低，栽秧后要立即加强管理，早追肥，早耘田，早治病虫，促进早发。中稻播种要抓紧扫尾。茶树这时春梢发育最快，稍一疏忽，茶叶就要老化，正所谓“谷雨很少摘，立夏摘不辍”，要集中全力，分批突击采制。
       立夏前后，华北、西北等地气温回升很快，但降水仍然不多，加上春季多风，蒸发强烈，大气干燥和土壤干旱常严重影响农作物的正常生长。尤其是小麦灌浆乳熟前后的干热风更是导致减产的重要灾害性天气，适时灌水是抗旱防灾的关键措施。“立夏三天遍地锄”，这时杂草生长很快，“一天不锄草，三天锄不了。”中耕锄草不仅能除去杂草，抗旱防渍，又能提高地温，加速土壤养分分解，对促进棉花、玉米、高梁、花生等 作物苗期健壮生长有十分重要的意义。
       立夏后，是早稻大面积栽插的关键时期，而且这时期雨水来临的迟早和雨量的多少，与日后收成关系密切。农谚说得好：“立夏不下，犁耙高挂。”“立夏无雨，碓头无米。”民间还有畏忌夏季炎热而称体重的习俗，据说这一天称了体重之后，就不怕夏季炎热，不会消瘦，否则会有病灾缠身。江西一带还有立夏饮茶的习俗，说是不饮立夏茶，会一夏苦难熬。早在古代的君王们也常在夏季初始的日子，到城外去迎夏，迎夏的日子就是立夏日。
<html/>"

    }
    ListElement{
        fest:"母亲节"
        picture:"muqinjie.jpg"
        detail:"母亲节（Mother's Day），是一个感谢母亲的节日。是每年5月的第二个星期日。"
        story:"<html>
<p><p><p>&nbsp;&nbsp;母亲节是在中国港澳台地区流行起来之后才进入大陆的，名贵的珠宝，象征母爱的康乃馨，特制的爱心甜点，精致的手工贺卡等，成为人们向母亲敬献爱意的礼物。20世纪80年代，母亲节逐渐被中国内地的民众所接受。从1988年开始，中国南方的广州等一些城市开始举办母亲节的庆祝活动，并把评选“好母亲”作为内容之一。20世纪末，随着中国与国际的日益接轨，母亲节这一节日在中国大陆各地日益推广开来，越来越多的人开始接受母亲节概念，在每年5月的第二个星期日，中国人和全世界其他国家的人们一道以各种各样的方式表达对母亲养育之恩的感谢。  母与子当然，中国人的母亲节更有中国味道。中国人以自己特有的方式表达浓浓的亲情，在母亲节这一天，人们会送给母亲鲜花,蛋糕，亲手烹制的饭菜等等礼物。从小就孝敬父母的中国儿童会尝试着为母亲做饭，洗脸，化妆，演奏音乐，绘制图画，让母亲们快乐地过节。人们在这一天除了孝敬自己的生身母亲之外，还会以慈善募捐，志愿服务的方式向更多的母亲回报亲情。
<html/>"

    }
    ListElement{
        fest:"小满"
        picture:"xiaoman.jpg"
        detail:"小满（grain buds）是二十四节气之一，夏季的第二个节气。"
        story:"<html>
<p>&nbsp;&nbsp;《月令七十二候集解》：“四月中，小满者，物致于此小得盈满。”这时全国北方地区麦类等夏熟作物籽粒已开始饱满，但还没有成熟，约相当乳熟后期，所以叫小满。南方地区的农谚赋予小满以新的寓意：“小满不满，干断思坎”；“小满不满，芒种不管”。把“满”用来形容雨水的盈缺，指出小满时田里如果蓄不满水，就可能造成田坎干裂，甚至芒种时也无法栽插水稻。
<html/>"

    }

}
