// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"立冬"
        picture:"lidong.jpg"
        detail:"“立冬”节气，在每年的11月7日或8日，古时民间习惯以立冬为冬季开始。"
        story:"<html>
<p>&nbsp;&nbsp;日期计算：“立冬”节气在每年的11月7日或8日，有公式
<p>&nbsp;&nbsp;&nbsp;&nbsp; （Y*D+C）-L
<p>&nbsp;&nbsp;公式解读：Y=年数后2位，D=0.2422，L=闰年数，21世纪C=7.438，20世纪=8.218。
<p>&nbsp;&nbsp;举例说明：2088年立冬日期=[88×0.2422+7.438]-[88/4]=28-22=6，11月6日是立冬。
<p>&nbsp;&nbsp;例外：2089年的计算结果加1日。
<p>&nbsp;&nbsp;我国古时民间习惯以立冬为冬季的开始，《月令七十二候集解》说：“立，建始也”，又说：“冬，终也，万物收藏也。”其实，我国幅员广大，除全年无冬的华南沿海和长冬无夏的青藏高原地区外，各地的冬季并不都是于立冬日同时开始的。按气候学划分四季标准，以下半年候平均气温降到10℃以下为冬季，则“立冬为冬日始”的说法与黄淮地区的气候规律基本吻合。我国最北部的漠河及大兴安岭以北地区，9月上旬就早已进入冬季，首都北京于10月下旬也已一派冬天的景象，而长江流域的冬季要到“小雪”节气前后才真正开始。
"

    }
    ListElement{
        fest:"小雪"
        picture:"xiaoxue.jpg"
        detail:"11月22或23日为小雪节气。"
        story:"<html>
<p>&nbsp;&nbsp;《月令七十二候集解》曰：“十月中，雨下而为寒气所薄，故凝而为雪。小者未盛之辞。”
   <p>&nbsp;&nbsp;“小雪”是反映天气现象的节令。古籍《群芳谱》中说：“小雪气寒而将雪矣，地寒未甚而雪未大也。”《二十四节气解》中说：“雨为寒气所薄，故凝而为雪，小者未盛之辞。”
<p>节气物候
<p>&nbsp;&nbsp;我国古代将小雪分为三候：“一候虹藏不见；二候天气上升地气下降；三候闭塞而成冬。”由于天空中的阳  气上升，地中的阴气下降，导致天地不通，阴阳不交，所以万物失去生机，天地闭塞而转入严寒的冬天。
<p>&nbsp;&nbsp;小雪节气，东亚地区已建立起比较稳定的经向环流，西伯利亚地区常有低压或低槽，东移时会有大规模的冷空气南下，我国东部会出现大范围大风降温天气。小雪节气是寒潮和强冷空气活动频数较高的节气。强冷空气影响时，常伴有入冬第一次降雪。
<html/>"

    }
    ListElement{
        fest:"感恩节"
        picture:"ganenjie.jpg"
        detail:"11月的第四个星期四是感恩节。"
        story:"<html>
<p>&nbsp;&nbsp;感恩节是美国人民独创的一个古老节日，也是美国人合家欢聚的节日，因此美国人提起感恩节总是备感亲切。感恩节是美国国定假日中最地道、最美国式的节日，它和早期美国历史最为密切相关。
       1620年，一些朝拜者乘坐“五月花”号船去美洲寻求宗教自由。他们在海上颠簸了两个月之后，终于在酷寒的十一月里，在现在的马萨诸塞州的普利茅斯登陆。
<p>&nbsp;&nbsp;在第一个冬天，半数以上的移民都死于饥饿和传染病，活下来的人们在第一个春  感恩节食物火鸡季即1621年开始播种。整个夏天他们都热切地盼望着丰收的到来，他们深知自己的生存以及殖民地的存在都将取决于即将到来的收成。最后，庄稼获得了意外的丰收，为了感谢上帝赐予的丰收，举行了3天的狂欢活动。从此，这一习俗就沿续下来，并逐渐风行各地。1863年，美国总统林肯宣布每年十一月的第四个星期四为感恩节。感恩节庆祝活动便定在这一天，直到如今。届时，家家团聚，举国同庆，其盛大、热烈的情形，不亚于中国人过春节。
<p>&nbsp;&nbsp;感恩节庆祝模式许多年来从未改变。丰盛的家宴早在几个月之前就开始着手准备。人们在餐桌上可以吃到苹果、桔子、栗子、胡桃和葡萄，还有葡萄干布丁、碎肉馅饼、各种其他食物以及红莓苔汁和鲜果汁，其中最妙和最吸引人的大菜是烤火鸡和南瓜馅饼，这些菜一直是感恩节中最富于传统和最受人喜爱的食品。
       人人都赞成感恩节大餐必需以烤火鸡为主菜。火鸡在烘烤时要以面包作填料以吸收从中流出来的美味汁液，但烹饪技术常因家庭和地区的不同而各异，应用什么填料也就很难求得一致。
       另外，加拿大的感恩节是在十月的第二个星期一。<html/>"

    }

}
