// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"国庆节"
        picture:"guoqingjie.jpg"
        detail:"1949年10月1日，是新中国成立的纪念日。"
        story:"<html>
“国庆”一词，本指国家喜庆之事，最早见于西晋。西晋的文学家陆机在《五等诸侯论》一文中就曾有“国庆独飨其利，主忧莫与其害”的记载、我国封建时代、国家喜庆的大事，莫大过于帝王的登基、诞辰（清朝称皇帝的生日为万岁节）等。因而我国古代把皇帝即位、诞辰称为“国庆”。今天称国家建立的纪念日为国庆。
<p>&nbsp;&nbsp;1949年10国庆节的来历
        “国庆”一词，本指国家喜庆之事，最早见于西晋。西晋的文学家陆机在《五等诸侯论》一文中就曾有“国庆独飨其利，主忧莫与其害”的记载、我国封建时代、国家喜庆的大事，莫大过于帝王的登基、诞辰（清朝称皇帝的生日为万岁节）等。因而我国古代把皇帝即位、诞辰称为“国庆”。今天称国家建立的纪念日为国庆。
<p>&nbsp;&nbsp;1949年10月1日，是新中国成立的纪念日。这里应该说明一点，在许多人的印象中，1949年的10月l日在北京广场举行了有数十万军民参加的中华人民共和国开国大典。其实，人们头脑中的这一印象并不准确。因为，1949年10月1日在广场举行的典礼是中华人民共和国人民成立盛典，而不是开国大典。实际上，中华人民共和国的“开国”，也就是说中华人民共和国的成立，早在当年10月1日之前一个星期就已经宣布过了。<html/>"

    }
    ListElement{
        fest:"寒露"
        picture:"hanlu.jpg"
        detail:"每年10月8日或9日视太阳到达黄经195°时为寒露。"
        story:"<html/>
<p>&nbsp;&nbsp;每年10月8日或9日是太阳到达黄经195°时为寒露。《月令七十二候集解》说：“九月节，露气寒冷，将凝结也。”寒露的意思是气温比白露时更低，地面的露水更冷，快要凝结成霜了。  寒露天气寒露时节，南岭及以北的广大地区均已进入秋季，东北和西北地区已进入或即将进入冬季。首都北京大部分年份这时已可见初霜，除全年飞雪的青藏高原外，东北和新疆北部地区一般已开始降雪。
       我国古代将寒露分为三候：“一候鸿雁来宾；二候雀入大水为蛤；三候菊有黄华。”此节气中鸿雁排成一字或人字形的队列大举南迁；深秋天寒，雀鸟都不见了，古人看到海边突然出现很多蛤蜊，并且贝壳的条纹及颜色与雀鸟很相似，所以便以为是雀鸟变成的；第三候的“菊始黄华”是说在此时菊花已普遍开放。<html/>"

    }
    ListElement{
        fest:"霜降"
        picture:"shuangjiang.jpg"
        detail:"每年阳历10月23日前后，太阳到达黄经210度时为霜降。"
        story:"<html>
<p>&nbsp;&nbsp;霜降——天气渐冷，开始有霜。霜降一般是在每年公历的10月23日或24日。这时中国黄河流域一带出现初霜﹐大部分地区多忙于播种三麦等作物。
       我国古代将霜降分为三候：“一候豺乃祭兽；二候草木黄落；三候蜇虫咸俯。”此节气中豺狼将捕获的猎物先陈列后再食用；大地上的树叶枯黄掉落；蜇虫也全在洞中不动不食，垂下头来进入冬眠状态中。
       每年阳历10月23日前后，太阳到达黄经210度时为霜降。霜降表示天气更冷了，露水凝  霜降与农作物结成霜。《月令七十二候集解》：“九月中，气肃而凝，露结为霜矣”。此时，我国黄河流域已出现白霜，千里沃野上，一片银色冰晶熠熠闪光，此时树叶枯黄，在落叶了。古籍《二十四节气解》中说：“气肃而霜降，阴始凝也。”可见“霜降”表示天气逐渐变冷，开始降霜。气象学上，一般把秋季出现的第一次霜叫做“早霜”或“初霜”，而把春季出现的最后一次霜称为“晚霜”或“终霜”。从终霜到初霜的间隔时期，就是无霜期。也有把早霜叫“菊花霜”的，因为此时菊花盛开，北宋大文学家苏轼有诗曰：“千树扫作一番黄，只有芙蓉独自芳”。
       霜是水气凝成的，水气怎样凝成霜呢？南宋诗人吕本中在《南歌子•旅思》中写道：“驿内侵斜月，溪桥度晚霜。”陆游在《霜月》中写有“枯草霜花白，寒窗月新影。”说明寒霜出现于秋天晴朗的月夜。秋晚没有云彩，地面上如同揭了被，散热很多，温度骤然下降到0℃以下，靠地面不多的水汽就会凝结在溪边、桥间、树叶和泥土上，形成细微的冰针，有的成为六角形的霜花。霜，只能在晴天形成，人说“浓霜猛太阳”就是这个道理。<html/>"

    }
    ListElement{
        fest:"重阳节"
        picture:"chongyangjie.jpg"
        detail:"重阳节，农历九月初九，二九相重，称为“重九”。"
        story:"<html>
<p>&nbsp;&nbsp;重阳节，农历九月初九，二九相重，称为“重九”。汉中叶以后的儒家阴阳观，有六阴九阳。九是阳数，固重九亦叫“重阳”。民间在该日有登高的风俗，所以重阳节又称“登高节”。还有重九节、茱萸、菊花节等说法。由于九月初九“九九”谐音是“久久”，有长久之意，所以常在此日祭祖与推行敬老活动。重阳节与除夕、清明、盂兰盆三节也是中国传统节日里祭祖的四大节日。明朝以前本来有登高看老人星的皇室活动 永乐皇帝迁都北京后 纬度过高看不到该星就演变成只登高不看星了，随后人们也遗忘了看星的这个初衷 （纬度37度以下 才可见 北京 40度）。[1]近年来，人们对老人的推重，故此节日又被称为老人节。<html/>"

    }
    ListElement{
        fest:"万圣节"
        picture:"wanshengjie.jpg"
        detail:"万圣节为每年的11月1日。"
        story:" <html>
<p>&nbsp;&nbsp;万圣节（HALLOWEEN）为每年的11月1日，源自古代凯尔特民族(Celtic)的新年节庆，此时也是祭祀亡魂的时刻，在避免恶灵干扰的同时，也以食物祭拜祖灵及善灵以祈平安渡过严冬，是西方传统节日。当晚小孩会穿上化妆服，戴上面具，挨家挨户收集糖果。主要流行于英语世界，如不列颠群岛和北美，其次是澳大利亚和新西兰。现在，一些亚洲国家的年轻一辈，也开始倾向于过“洋节”，到了万圣节前夕，一些大型外资超市都会摆出专柜卖万圣节的玩具，小商贩也会出售一些跟万圣节相关的玩偶或模型，吸引了年轻人的眼光。<html/>"

    }
}
