// import QtQuick 1.0 // to target S60 5th Edition or Maemo 5
import QtQuick 1.1

ListModel{
    ListElement{
        fest:"白露"
        picture:"bailu.jpg"
        detail:"白露是24节气之一，此时气温开始下降，早晨草木上有了露水。"
        story:"<html>
<p>&nbsp;&nbsp;白露是九月的头一个节气。露是由于温度降低，水汽在地面或近地物体上凝结而成的水珠。所以，白露实际上是表征天气已经转凉。这时，人们就会明显地感觉到炎热的夏天已过，而凉爽的秋天已经到来了。因为白天的温度虽然仍达三十几度，可是夜晚之后，就下降到二十几度，两者之间的温度差达十多度。阳气是在夏至达到顶点，物极必反，阴气也在此时兴起。到了白露，阴气逐渐加重，清晨的露水随之日益加厚，凝结成一层白白的水滴，所以就称之为白露。俗语云：“处暑十八盆，白露勿露身。”这两句话的意思是说，处暑仍热，每天须用一盆水洗澡，过了十八天，到了白露，就不要赤膊裸体了，以免着凉。还有句俗话：“白露白迷迷，秋分稻秀齐。”意思是说，白露前后若有露，则晚稻将有好收成。<html/>"

    }
    ListElement{
        fest:"教师节"
        picture:"jiaoshijie.jpg"
        detail:"1985年1月21日，第六届全国人大第九次会议将每年的9月10日定为我国的教师节。"
        story:"<html>
<p>&nbsp;&nbsp;中国有悠久的尊师重道的传统，古代就有“人有三尊，君、父、师”的说法。《吕氏春秋•尊师》云：“生则谨养，死则敬祭，此尊师之道也。”《师说》中：“师者，所以传道授业解惑也。”在中国几千年的灿烂历史中，“师”，总是受人尊敬，被人爱戴的。老师，是人类文化得以传承的功臣，他们做的贡献是极其巨大的。
<p>9月10日历史上的今天
<p>&nbsp;&nbsp;教师节的宗旨就是提高人们对教师为教育事业所做贡献的认识和评价。1931年，教育家邰爽秋、程其保等在南京中央大学集会，发表要求“改善教师待遇，保障教师工作和增进教师修养”的宣言，并议定6月6日为教师节，也称双六节。不久，国民党政府先是同意6月6日为教师节，后又将教师节改为公历9月28日（孔子生日）。<html/>"

    }
    ListElement{
        fest:"秋分"
        picture:"qiufen.jpg"
        detail:"秋分（autumnal equinox），农历二十四节气中的第十六个节气，时间一般为每年的9月22或23日。"
        story:" <html>
<p>&nbsp;&nbsp;我国古籍《春秋繁露•阴阳出入上下篇》中说：“秋分者，阴阳相半也，故昼夜均而寒暑平。”秋分之“分”为“半”之意。  秋分“秋分”的意思有二：
<p>&nbsp;&nbsp;一是太阳在这一天到达黄经180度，直射地球赤道，因此这一天的24小时昼夜均分，各12小时；全球无极昼极夜现象。
<p>&nbsp;&nbsp;二是按我国古代以立春、立夏、立秋、立冬为四季开始的季节划分法，秋分日居秋季90天之中，平分了秋季。
秋分在每年公历的9月22日，23日或24日，为中国传统节日中的二十四节气之一，此时太阳到达黄经180度。秋分的含义《月令七十二候集解》：“八月中……解见春分”。“分”示昼夜平分之意，同春分一样，此日阳光直射地球赤道，昼夜相等。此后，阳光直射位置更向南移，北半球渐趋昼短夜长，气温降低，在全国具有普遍意义。我国古代将秋分分为三候：“一候雷始收声；二候蛰虫坯户；三候水始涸”。意思是雷是因为阳气盛而发声，秋分后阴气开始旺盛，所以不再打雷了。秋分，“分”即为“半”。秋分时，全球昼夜等长。秋分之后，北半球各地昼渐短夜渐长，南半球各地昼渐长夜渐短。我国古籍《春秋繁露•阴阳出入上下篇》中说：“秋分者，阴阳相半也，故昼夜均而寒暑平。”秋分的特点秋分节气是二十四节气中比较特殊的。主要有两个特点：一是太阳在这一天到达黄经180度，直射地球赤道，因此这一天的24小时昼夜均分，各12小时；全球无极昼极夜现象。 二是按我国古代以立春、立夏、立秋、立冬为四季开始的季节划分法，秋分日居秋季90天之中，平分了秋季。 秋分的气候秋分时节，我国大部分地区已经进入凉爽的秋季，南下的冷空气与逐渐衰减的暖湿空气相遇，产生一次次的降水，气温也一次次地下降。正如人们常所说的那样，已经到了“一场秋雨一场寒”的时候，但秋分之后的日降水量不会很大。此时，南、北方的田间耕作各有不同。在我国的华北地区有农谚说：“白露早，寒露迟，秋分种麦正当时。”谚语中明确规定了该地区播种冬小麦的时间；而“秋分天气白云来，处处好歌好稻栽”则反映出江南地区播种水稻的时间。此外，劳动人民对秋分节气的禁忌也总结成谚语，如“秋分只怕雷电闪，多来米价贵如何”。
<html/>"
    }
    ListElement{
        fest:"中秋节"
        picture:"zhongqiujie.jpg"
        detail:"中秋节，中国传统节日之一，为每年农历八月十五。又称秋夕、八月节、团圆节。"
        story:"<html>
<p>&nbsp;&nbsp;八月为秋季的第二个月，古时称为仲秋，因处于秋季之中和八月之中，故民间称为中秋，又称秋夕、八月节、八月半、月夕、月节 ，又因为这一天月亮满圆，象征团圆，又称为 团圆节。
<p>&nbsp;&nbsp;中秋节美食首推月饼，其起源说法多种。一说元代末年，江苏泰州的反元起义领袖张士诚（或说是朱元璋的谋士刘伯温）利用中秋民众互赠圆饼之际，在饼中夹带“八月十五夜杀鞑子”的字条，大家见了饼中字条，一传十，十传百，如约于这天夜里一起手刃无恶不作的“鞑子”（元兵），过后家家吃饼庆祝起义胜利，并正式称中秋节的圆饼为月饼。在后来很长历史时期，甚至在上世纪末，许多月饼上还贴有一方小纸片！只可惜，近年所产月饼已不见小纸片踪影，月饼所含代代相传的“文化密码”荡然无存。另有一说为，明洪武初年，大将徐达攻下元朝残余势力盘踞的元大都北京，捷报传到首都南京，正在下棋的明太祖朱元璋欣喜若狂，即传谕中秋节普天同庆，并将当初反元大起义时传递信息的月饼赏赐臣民。月饼从此成为中秋节“法定”的食品，非食不可了。
<p>&nbsp;&nbsp;吃月饼以示“团圆”。月饼，又叫胡饼、宫饼、月团、丰收饼、团圆饼等，是古代中秋祭拜月神的供品。相传我国古代，帝王就有春天祭日、秋天祭月的礼制。在民间，每逢八月中秋，也有左右拜月或祭月的风俗。“八月十五月儿圆，中秋月饼香又甜”，这句名谚道出中秋之夜城乡人民吃月饼的习俗。月饼最初是用来祭奉月神的祭品，后来人们逐渐把中秋赏月与品尝月饼，作为家人团圆的一大象征，慢慢的，月饼也就成为了节日的必备礼品。<html/>"

    }

}
